<p><a name="sections"></a></p>


# Sections

- <a href="#DS">Data Structure</a><br>
- <a href="#DM">Data Manipulation</a><br>
- <a href="#miss">Handling Missing Data</a><br>
- <a href="#grouping">Grouping and aggregration</a><br>
- <a href="#time">Time Series</a><br>
- <a href="#sol">Solutions</a><br>

# Pandas

<p><a name="DS"></a></p>
### Data Structure

- Pandas is a Python package built on top of NumPy.  It is particularly strong in the area of handling spreadsheet structures, dealing with missing data, and processing time series data.

- We will talk about three data structure objects in today's lecture: Series, DataFrame and Time Series.

These are the new data types introduced by pandas:

- **Series**: 1D labeled homogeneously-typed array.
- **DataFrame**: General 2D labeled, size-mutable tabular structure with potentially heterogeneously-typed columns.
- **Time Series**: Series with index containing datetimes.

Import the package, as follows:

In [1]:
import numpy as np
import pandas as pd

<p><a name="series"></a></p>
## Series

- A series is a one-dimensional array-like object containing homogenously typed elements.   
- Each element has an associated data label, called its index. By default, the index consists of ordinary array indices, i.e. consecutive integers starting from zero.

In [2]:
obj = pd.Series(['a', 'b', 'c', 'd'])
obj

0    a
1    b
2    c
3    d
dtype: object

In [5]:
obj.index  #this is the default index

RangeIndex(start=0, stop=4, step=1)

- An entry can be retrieved using the index, as follows:

In [4]:
obj[0]

'a'

- Often it will be more desirable to create a series with a custom index. 
- Here the index is manually set the index from 1 to 4, with 4 repeated. Note there are two rows with the same index 4.

In [9]:
obj2 = pd.Series(['a', 'b', 'c', 'd','e'], index=[1, 2, 3, 4, 4])
obj2

1    a
2    b
3    c
4    d
4    e
dtype: object

- Calling that entry gives both values.  In this way a series is different from a dictionary.

In [10]:
obj2.index #custom index

Int64Index([1, 2, 3, 4, 4], dtype='int64')

In [11]:
obj2[4]

4    d
4    e
dtype: object

In [6]:

U = pd.Series(['a', 'b', 'a'], dtype='category')
X = range(10)
X= pd.Categorical(X)
W = U.cat
W = pd.Categorical(1)
U.infer_objects()

0    a
1    b
2    a
dtype: category
Categories (2, object): [a, b]

- The index value may also be a string.  A new entry with a string index is written:

In [15]:
obj2['something']=660
obj3 = obj2.copy()
obj3['something'] = 1000
print(obj2)

1              a
2              b
3              c
4              d
4              e
something    660
dtype: object

- Note the entries are not retrievable by their place but the value of their index.

In [16]:
print(obj[1])
print(obj2[5]) # This one also works
print(obj2[6]) # KeyError

b
660

IndexError: index out of bounds

- The attribute `values` returns all the values.
- Under the hood, the so-called "attribute" **values** is in fact a python **property**.

In [19]:
obj2.values?

In [11]:
obj2.values[1]   # obj.values is simply an array

'b'

- The **Series** object is similar to a **dictionary**, `Series.index` is like `dictionary.keys`, and `Series.values` is like `dictionary.values`. Directly convert a dictionary to a Series, as follows:

In [86]:
dict_ = {1: 'a', 2: 'b', 3: 'c', 4: 'd'}
obj3 = pd.Series(dict_)
obj3

1    a
2    b
3    c
4    d
dtype: object

Convert a Series back to a dictionary.

In [13]:
obj3.to_dict()

{1: 'a', 2: 'b', 3: 'c', 4: 'd'}

Note what happens in translating a series with repeated index values.  Only the last entry for the repeated index is included in the dictionary.

In [14]:
obj2.to_dict()

{'something': 660, 1: 'a', 2: 'b', 3: 'c', 4: 'e'}

<p><a name="DF"></a></p>
## DataFrame

- A data frame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns.
- Each column can be a different type (integers, strings, floating point numbers, Python objects, etc.).  
- All columns must be the same length, to give the data frame a defined shape.

In [21]:
data = {'commodity': ['Gold', 'Gold', 'Silver', 'Silver'],
        'year': [2013, 2014, 2014, 2015],
        'production_Moz': [107.6, 109.7, 868.3, 886.7]} #world wide in million oz

# convert to DataFrame
df = pd.DataFrame(data, dtype=str)
df = df.astype({'commodity':'category', 'year':int, 'production_Moz':float})
#pd.to_numeric(df['commodity'], errors='coerse')
#df.infer_objects().dtypes
df['commodity'].cat

In [40]:
df.columns 
np.shape(np.zeros(4))

(4,)

In [98]:
df.index #standard index

RangeIndex(start=0, stop=4, step=1)

In [99]:
df.index=([4,5,6,7])
df

  commodity  production_Moz  year
4      Gold           107.6  2013
5      Gold           109.7  2014
6    Silver           868.3  2014
7    Silver           886.7  2015

In [100]:
df.index #custom integer index

Int64Index([4, 5, 6, 7], dtype='int64')

- The index may be set using the method `set_index`, as follows:

In [20]:
df=df.set_index('commodity')
df

           production_Moz  year
commodity
Gold                107.6  2013
Gold                109.7  2014
Silver              868.3  2014
Silver              886.7  2015

In [21]:
df.index #custom string index

Index(['Gold', 'Gold', 'Silver', 'Silver'], dtype='object', name='commodity')

In [22]:
#floats can also be an index
df.set_index('production_Moz').index

Float64Index([107.6, 109.7, 868.3, 886.7], dtype='float64', name='production_Moz')

In [23]:
df

           production_Moz  year
commodity
Gold                107.6  2013
Gold                109.7  2014
Silver              868.3  2014
Silver              886.7  2015

In [24]:
df['year'] #this yields a pandas series

commodity
Gold      2013
Gold      2014
Silver    2014
Silver    2015
Name: year, dtype: int64

In [25]:
df[['year']] #this yields a pandas data frame

           year
commodity
Gold       2013
Gold       2014
Silver     2014
Silver     2015

- The dataframe can restore the original index using the mathod `reset_index`, as follows:

In [26]:
df = df.reset_index()
df

  commodity  production_Moz  year
0      Gold           107.6  2013
1      Gold           109.7  2014
2    Silver           868.3  2014
3    Silver           886.7  2015

- A data frame can also be created with a nested list. The two ways are equivalent.

In [27]:
df_2 = pd.DataFrame([[107.6, 'Gold', 2013],
                   [109.7, 'Gold', 2014],
                   [868.3, 'Silver', 2014],
                   [886.7, 'Silver', 2015]], 
                    columns=['production_Moz','commodity','year'])
df_2

   production_Moz commodity  year
0           107.6      Gold  2013
1           109.7      Gold  2014
2           868.3    Silver  2014
3           886.7    Silver  2015

- A data frame has an attribute **values** (more accurately, a **property**), which is of the multidimensional array type.

In [27]:
print(type(df.values))
dir(df)
df.values[1,1] = 1
df.values[1,1]

<class 'numpy.ndarray'>

109.7

In [42]:
print(df.values)
print('-'*55)
print(df_2.values)

[['Gold' 107.6 2013]
 ['Gold' 109.7 2014]
 ['Silver' 868.3 2014]
 ['Silver' 886.7 2015]]
-------------------------------------------------------

NameError: name 'df_2' is not defined

- data frame v.s. series is similar to 2D array v.s. 1D array. A data frame has column names for the additional dimension.

In [30]:
print(type(df.columns))

<class 'pandas.core.indexes.base.Index'>

In [31]:
print(df.columns)  # column name

Index(['commodity', 'production_Moz', 'year'], dtype='object')

In [23]:
df.columns.tolist()
#list(df.columns)

['commodity', 'production_Moz', 'year']

- Each column in a DataFrame can be retrieved as a Series. 
- There are two ways to get the column: to retrieve by attribute and to retrieve by dictionary-like notation.

In [33]:
df.year         # retrieve by attribute

0    2013
1    2014
2    2014
3    2015
Name: year, dtype: int64

In [34]:
df['year']  # retrieve by dictionary-like notation

0    2013
1    2014
2    2014
3    2015
Name: year, dtype: int64

- The name of an individual column may be changed as follows:

In [35]:
df.columns=['commodity', 'com','production']
df

  commodity    com  production
0      Gold  107.6        2013
1      Gold  109.7        2014
2    Silver  868.3        2014
3    Silver  886.7        2015

In [45]:
df.columns = df.columns.str.replace('com','metal')
df

  metalmodity  production_Moz  year
0        Gold           107.6  2013
1        Gold           109.7  2014
2      Silver           868.3  2014
3      Silver           886.7  2015

- Indexing a pandas data frame is similar to indexing a numpy array. In pandas the first index retrieves a column and the second index retrieves the row.  
- To return the third element of the metal column, use the following:

In [37]:
df['metal'][2]

868.29999999999995

- Slicing a pandas data frame is also similar to slicing a numpy array.  The following code returns the second and third elements of the production column.

In [38]:
df['production'][1:3]

1    2014
2    2014
Name: production, dtype: int64

- In order to slice multiple columns pass a list of column names.  The following represents the world production of gold and silver in 2014.

In [39]:
df[['metal','production']][1:3]

   metal  production
1  109.7        2014
2  868.3        2014

** Exercise 1** 

Create a Pandas DataFrame, named 'NYC', whose columns are 'boro', 'pop' and 'area'. The frame represents the five boroughs of New York City, including the 2010 census population (in millions),and land area in square miles.  The rows represent the following:

- The Bronx is 42 square miles.  In the 2010 census, the Bronx had 1.39 million people.
- Manhattan, with 2010 population 1.59 million, has an area of 23 square miles.
- Brooklyn is 71 square miles.  The 2010 population was 2.47 million.
- In 2010, Staten Island had 0.44 million inhabitants.  It is 59 square miles.
- 2.23 million people lived across the 109 square miles of Queens, in 2010.

Create a new column representing the population density using:
```
NYC['density']=NYC['pop']/NYC['area']
```

Now set the index of NYC to be the borough names using `set_index` function of a data frame. Make sure to update the data frame.

In [57]:
#### Your code here
boro = ['Bronx', 'Manhattan', 'Brooklyn', 'Staten Island', 'Queens']
pop  = [1.39e6,1.59e6,2.47e6,0.44e6,2.23e6]
area = [42, 23, 71, 59, 109]
NYC = pd.DataFrame({'boro':boro,
                    'pop':pop,
                     'area':area})
NYC['density'] = NYC['pop']/NYC['area']
NYC = NYC.set_index('boro')
NYC

               area        pop       density
boro
Bronx            42  1390000.0  33095.238095
Manhattan        23  1590000.0  69130.434783
Brooklyn         71  2470000.0  34788.732394
Staten Island    59   440000.0   7457.627119
Queens          109  2230000.0  20458.715596

<p><a name="IO"></a></p>
## I/O tools

- Pandas has a number of functions for reading tabular data as a data frame object.

In [41]:
!cat foo.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [42]:
!type foo.csv # Windows user

/bin/sh: line 0: type: foo.csv: not found

In [43]:
pd.read_csv('foo.csv')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

- In some cases, there is no header in the file. By setting `header = None`, the column names will be filled with incremental numbers.

In [44]:
!cat foo_noheader.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [46]:
my_df=pd.read_csv('foo_noheader.csv', header = None)
print(my_df)
my_df.index
pd.read_csv?

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo


- The column names may then be set, as follows:

In [46]:
my_df.columns=['a', 'b', 'c', 'd', 'message']
my_df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

- Another way is to pass the column names (as a list of strings) to the `names` parameter in `read_csv`.  
- Note the parameter is called "names" instead of "columns".

In [53]:
# Set the names manually
U = pd.read_csv('foo_noheader.csv', 
             names=['a', 'b', 'c', 'd', 'message'], dtype={'a':float, 'b':'category'})
U.dtypes

a           float64
b          category
c             int64
d             int64
message      object
dtype: object

- Importing files has been covered. This exercise demonstrates file exporting.

**Exercise 2** 

- Write the data frame, `NYC`, to a file, NYC.csv. The function `to_csv` is useful for this task.
- Now load 'NYC.csv' to a data frame named NYC2.

In [48]:
#### Your code here
NYC.to_csv('NYC.csv')

In [49]:
NYC

               area        pop       density
boro
Bronx            42  1390000.0  33095.238095
Manhattan        23  1590000.0  69130.434783
Brooklyn         71  2470000.0  34788.732394
Staten Island    59   440000.0   7457.627119
Queens          109  2230000.0  20458.715596

In [50]:
!cat NYC.csv

boro,area,pop,density
Bronx,42,1390000.0,33095.23809523809
Manhattan,23,1590000.0,69130.43478260869
Brooklyn,71,2470000.0,34788.7323943662
Staten Island,59,440000.0,7457.627118644068
Queens,109,2230000.0,20458.715596330276

In [54]:
NYC2=pd.read_csv('NYC.csv', index_col=0, dtype={'area':float, 'pop':int}) # use the first column as index
NYC2

                area      pop       density
boro
Bronx           42.0  1390000  33095.238095
Manhattan       23.0  1590000  69130.434783
Brooklyn        71.0  2470000  34788.732394
Staten Island   59.0   440000   7457.627119
Queens         109.0  2230000  20458.715596

<p><a name="DM"></a></p>
# Data Manipulation in Pandas

- Like numpy, pandas defines many broadcast operations, as well as numerous methods of manipulating data.

<p><a name="concat"></a></p>
### concat
Pandas DataFrames can be expanded in both directions. First create two data frames.

In [52]:
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                   columns=['a', 'b', 'c'],
                   index=['one', 'two', 'three'])
df2 = pd.DataFrame(np.arange(6).reshape((3, 2)), 
                   columns=['d','e'],
                   index=['three', 'two','one'])
df1

       a  b  c
one    0  1  2
two    3  4  5
three  6  7  8

In [53]:
df2

       d  e
three  0  1
two    2  3
one    4  5

- Since the two data frames have the same number of rows, it is natural to combine them "horizontally".  
- Note the concatenation takes place on the name of the index and not the order.

In [54]:
pd.concat([df1, df2], axis = 1)

       a  b  c  d  e
one    0  1  2  4  5
three  6  7  8  0  1
two    3  4  5  2  3

In [55]:
np.hstack((df1.values, df2.values))

array([[0, 1, 2, 0, 1],
       [3, 4, 5, 2, 3],
       [6, 7, 8, 4, 5]])

- More generally the **np.concatenate** can **glue** two arrays along a specified axies.

- The argument "axis = 1" means expanding along the column indices. Setting "axis = 0" will combine two data frames with same number of columns vertically. 

- Now changing the name of row 'one' to One' gives it a different index.  In this case the concatenation will use all the rows, filling in missing values with NaN.

In [94]:
df1 = pd.DataFrame(np.arange(9).reshape((3, 3)), 
                   columns=['a', 'b', 'c'],
                   index=['One', 'two', 'three'])
df2 = pd.DataFrame(np.arange(6).reshape((3, 2)), 
                   columns=['d','e'],
                   index=['three', 'two','one'])
print(df1,'\n\n',df2)

       a  b  c
One    0  1  2
two    3  4  5
three  6  7  8

        d  e
three  0  1
two    2  3
one    4  5

In [57]:
pd.concat([df1, df2], axis = 1)

         a    b    c    d    e
One    0.0  1.0  2.0  NaN  NaN
one    NaN  NaN  NaN  4.0  5.0
three  6.0  7.0  8.0  0.0  1.0
two    3.0  4.0  5.0  2.0  3.0

- To include only the shared rows, set the join parameter to 'inner', as following:

In [58]:
pd.concat([df1, df2], axis = 1, join='inner')

       a  b  c  d  e
two    3  4  5  2  3
three  6  7  8  0  1

**Exercise 3**

In the jupyter notebook, create the data frame below.  Observe that this is a data frame with new features.  

There are three new features:

- **high_point** is the location of highest elevation 
- **geography** indicates if the borough is an island, on an island, or mainland
- **inception** indicates the year of incorporation into the City of New York

Combine 'new_features' with the old NYC data frame to make a new data frame named 'NYC3'.

In [55]:
new_features = pd.DataFrame({'high_point': ['Battle Hill', 'Chapel Farm', 'North Glen Oaks', 'Bennett Park','Todt Hill'],\
                            'geography':['on island','on mainland','on island','is an island','is an island'],\
                           'inception':['1634','1898','1683','1624','1683']},\
                            index=['Brooklyn', 'Bronx', 'Queens', 'Manhattan',"Staten Island"])
new_features

                  geography       high_point inception
Brooklyn          on island      Battle Hill      1634
Bronx           on mainland      Chapel Farm      1898
Queens            on island  North Glen Oaks      1683
Manhattan      is an island     Bennett Park      1624
Staten Island  is an island        Todt Hill      1683

In [58]:
#### Your code here (Notice that the pd.concat will re-align the row index automatically.)
NYC3 = pd.concat((NYC, new_features),axis=1)
NYC3

,area,pop,density,geography,high_point,inception
Bronx,42,1390000.0,33095.238095,on mainland,Chapel Farm,1898
Brooklyn,71,2470000.0,34788.732394,on island,Battle Hill,1634
Manhattan,23,1590000.0,69130.434783,is an island,Bennett Park,1624
Queens,109,2230000.0,20458.715596,on island,North Glen Oaks,1683
Staten Island,59,440000.0,7457.627119,is an island,Todt Hill,1683

<p><a name="sort"></a></p>
### sort
- It is possible to order the rows of data frames using `sort_values()`.  This object method takes a column name as an argument.
- It is used on the new_features data frame to order by date of inception, as follows:

In [59]:
new_features.sort_values(['inception','high_point'])

                  geography       high_point inception
Manhattan      is an island     Bennett Park      1624
Brooklyn          on island      Battle Hill      1634
Queens            on island  North Glen Oaks      1683
Staten Island  is an island        Todt Hill      1683
Bronx           on mainland      Chapel Farm      1898

By default the sort is done in ascending order.  To apply the sort in decending order, set the `ascending` parameter to `False`.

In [62]:
new_features.sort_values('inception',ascending=False)

                  geography       high_point inception
Bronx           on mainland      Chapel Farm      1898
Queens            on island  North Glen Oaks      1683
Staten Island  is an island        Todt Hill      1683
Brooklyn          on island      Battle Hill      1634
Manhattan      is an island     Bennett Park      1624

<p><a name="merge"></a></p>
### merge
Merging is the most common way to combine multiple data frames. Create two data frames first.

In [63]:
df3 = pd.DataFrame([['a','b','c'],['d','e','f'],['g','h','i']]\
                   ,columns=['col1','col2','col3'])
df4 = pd.DataFrame({'col2':['x','e','b','z'],'col4':[1,2,3,4],'col5':['i','f','e','h']})
df3

  col1 col2 col3
0    a    b    c
1    d    e    f
2    g    h    i

In [64]:
df4

  col2  col4 col5
0    x     1    i
1    e     2    f
2    b     3    e
3    z     4    h

- Merging will use the **`on`** column as a key for the merge.  The code below identifies the column ‘col2’ from both data frames. 
- The argument **`how`** set to 'inner' makes the merge only keep rows occuring in both data frames.

In [65]:
pd.merge(df3, df4, how='inner', on ='col2')

  col1 col2 col3  col4 col5
0    a    b    c     3    e
1    d    e    f     2    f

- The default value of the parameter `how` is 'inner'. The following code performs the same task as above.

In [66]:
pd.merge(df3, df4, on ='col2')

  col1 col2 col3  col4 col5
0    a    b    c     3    e
1    d    e    f     2    f

- To keep every row in df1 then set the parameter `how` = 'left'.

In [67]:
pd.merge(df3, df4, how='left', on ='col2')

  col1 col2 col3  col4 col5
0    a    b    c   3.0    e
1    d    e    f   2.0    f
2    g    h    i   NaN  NaN

- To keep all rows from both df1 and df2, set the parameter `how` = 'outer'.

In [68]:
pd.merge(df3, df4, how='outer', on ='col2')

  col1 col2 col3  col4 col5
0    a    b    c   3.0    e
1    d    e    f   2.0    f
2    g    h    i   NaN  NaN
3  NaN    x  NaN   1.0    i
4  NaN    z  NaN   4.0    h

- If the `on` column does not have the same name in the two data frames, use 'left_on' and 'right_on' to indicate how to perform the merge.  
- Note that columns with the same name, in the two data frames, will be named with an x or y character appended.

In [69]:
pd.merge(df3, df4, left_on='col2', right_on='col5')

  col1 col2_x col3 col2_y  col4 col5
0    d      e    f      b     3    e
1    g      h    i      z     4    h

**Exercise 4**

- Run the following code to create a data frame, 'Elevations'. It contains NYC locations and their elevation in feet.  How is this related to the NYC data frame? Why separate this information into another data frame?
- Combine this data with the full NYC3 data frame to make a new data frame named NYC4.
- Note NYC3 is indexed using boro, we want to keep it after the merge.
- Change the name of the elevation column to 'peak_elevation'.
- Order the data frame by highest to lowest 'peak_elevation'.

In [60]:
Elevations = pd.DataFrame([['Battle Hill',220],['Marcus Garvey Park',103],['Bennett Park',265],\
                           ['Todt Hill',410],['Washington Square Park',27],['Chapel Farm',280],\
                           ['Bryant Park',58],['North Glen Oaks',258],['St Marys Park',47]],
                      columns=['location', 'elevation'])
Elevations
NYC3

,area,pop,density,geography,high_point,inception
Bronx,42,1390000.0,33095.238095,on mainland,Chapel Farm,1898
Brooklyn,71,2470000.0,34788.732394,on island,Battle Hill,1634
Manhattan,23,1590000.0,69130.434783,is an island,Bennett Park,1624
Queens,109,2230000.0,20458.715596,on island,North Glen Oaks,1683
Staten Island,59,440000.0,7457.627119,is an island,Todt Hill,1683

In [92]:
# Your code here
NYC4 = pd.merge(NYC3.reset_index(), Elevations, left_on='high_point', right_on='location')
NYC4 = NYC4.set_index('index')
NYC4.index.rename('boro',inplace=True)
columns = NYC4.columns.values
columns[-1] = 'x'
NYC4.columns.reindex(columns)
NYC4.head()

,area,pop,density,geography,high_point,inception,location,x
boro,,,,,,,,
Bronx,42,1390000.0,33095.238095,on mainland,Chapel Farm,1898,Chapel Farm,280
Brooklyn,71,2470000.0,34788.732394,on island,Battle Hill,1634,Battle Hill,220
Manhattan,23,1590000.0,69130.434783,is an island,Bennett Park,1624,Bennett Park,265
Queens,109,2230000.0,20458.715596,on island,North Glen Oaks,1683,North Glen Oaks,258
Staten Island,59,440000.0,7457.627119,is an island,Todt Hill,1683,Todt Hill,410

<p><a name="SF"></a></p>
### selection and filter

- The `loc` method provides purely label (index/columns)-based indexing. 
- This method allows selection from a data frame by index and columns.

In [106]:
df1
df1.loc['One',['a','c']] = 30
df1

        a  b   c
One    30  1  30
two     3  4   5
three   6  7   8

The following returns a single column of df1.

In [109]:
df1['a'].copy() #gives series
df1.copy()

        a  b   c
One    30  1  30
two     3  4   5
three   6  7   8

In [107]:
#df1[1] #this throws an error
df1['two'].copy()

KeyError: 'two'

In [101]:
type(df1['a'])

pandas.core.series.Series

In [102]:
df1[['a']] #gives a single column data frame

         a
One    100
two      3
three    6

In [103]:
df1[['a','c']] #gives a multi column data frame

         a  c
One    100  2
two      3  5
three    6  8

- The following uses `loc` to return a single row of df1, using the index string name.

In [78]:
df1.loc['two'] # the row that has index two

a    3
b    4
c    5
Name: two, dtype: int64

In [79]:
df1.loc[['two']] # the row that has index two

     a  b  c
two  3  4  5

- A second parameter is passed to loc to specify the chosen column. For example:

In [111]:
df1.loc['two', 'b'] # the row that has index two and column b
df1.loc?

- Note the two ways to accomplish this:

In [110]:
print(df1.loc['two', 'b'])
print(df1['b'][1])

4
4

- Fancy indexing can be done with `loc` in pandas, as was done in Numpy. Select a row with a condition, as follows. 
- The code below returns all columns for the rows in which column 'a' is zero.

In [82]:
df1.loc[df1.a==0,:]

     a  b  c
One  0  1  2

- Columns are selected in a similar way.  The code below returns all rows for the columns in which row 'one' is zero.

In [112]:
df1.loc[:, df1.loc['One']==0]

Empty DataFrame
Columns: []
Index: [One, two, three]

- Note: loc only accepts labels as input. If you try to use numbers, it will give you an error. For example:

In [84]:
df1.loc[1, 2]

TypeError: cannot do label indexing on <class 'pandas.core.indexes.base.Index'> with these indexers [1] of <class 'int'>

- To select data by position number, use iloc. The iloc method provides a purely position based indexing.

In [85]:
# select as a matrix 
# row 2, col 3
df1.iloc[1, 2]

5

In [86]:
# first row, first two columns
# return a Series
row1 = df1.iloc[0,:2]
row1

a    0
b    1
Name: One, dtype: int64

- You can also use a list to slice the dataframe.

In [87]:
df1.iloc[[0,2], :2]

       a  b
One    0  1
three  6  7

In [113]:
NYC4 #look at NYC4 again

,area,pop,density,geography,high_point,inception,location,x
boro,,,,,,,,
Bronx,42,1390000.0,33095.238095,on mainland,Chapel Farm,1898,Chapel Farm,280
Brooklyn,71,2470000.0,34788.732394,on island,Battle Hill,1634,Battle Hill,220
Manhattan,23,1590000.0,69130.434783,is an island,Bennett Park,1624,Bennett Park,265
Queens,109,2230000.0,20458.715596,on island,North Glen Oaks,1683,North Glen Oaks,258
Staten Island,59,440000.0,7457.627119,is an island,Todt Hill,1683,Todt Hill,410

In [114]:
#get the i=2 and i=4 column of NYC4
NYC4.iloc[:,[2,4]]

                    density       high_point
boro
Bronx          33095.238095      Chapel Farm
Brooklyn       34788.732394      Battle Hill
Manhattan      69130.434783     Bennett Park
Queens         20458.715596  North Glen Oaks
Staten Island   7457.627119        Todt Hill

- DataFrame’s apply method applies a function on 1D arrays to each column or row.

In [90]:
df1.apply(lambda x: max(x), axis=0) # 0 stands for apply to each column

a    6
b    7
c    8
dtype: int64

In [91]:
df1.apply(lambda x: min(x), axis=1) # 1 stands for apply to each row

One      0
two      3
three    6
dtype: int64

- If you just want to apply the function to a single column, you can extract that specific series first and then call the `map()` method just like the `map` operator in Python.

In [92]:
df1.a.map(lambda x: x+1)

One      1
two      4
three    7
Name: a, dtype: int64

### Removing data

In [93]:
#this removes row 'two'
df1.loc[df1.index != 'two']
df1

       a  b  c
One    0  1  2
two    3  4  5
three  6  7  8

In [115]:
#this removes column 'a'
df1.drop('a', 1)
df1.drop?

- Rows and columns may also be removed using fancy indexing or `drop()`.

In [116]:
#this removes column b
df1.loc[:,df1.columns != 'b']

        a   c
One    30  30
two     3   5
three   6   8

In [96]:
# remember the following expression is a boolean and acts as a mask
df1.columns != 'b'

array([ True, False,  True], dtype=bool)

In [97]:
#this removes column 'b'
df1.drop('b', axis=1)

       a  c
One    0  2
two    3  5
three  6  8

<p><a name="miss"></a></p>
# Handling Missing Data

- Missing or, equivalently, corrupted data is an unavoidable reality in processing large data sets.  There are various ways of dealing with it, depending upon the circumstances:
 - Discard it, and all related data.
 - Interpolate values from surrounding data
 - Isolate it and analyze it separately

- Which approach to use is a scientific question.  Whatever approach is chosen, pandas has computational methods to carry it out.
- Read a csv file that contains NaNs. **Note:** index_col is set to 0.  This means the first column is used as the index.

In [117]:
df_miss = pd.read_csv('missing.csv',index_col=0)
df_miss

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d       NaN       NaN       NaN       NaN
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

- To figure out where the missing data is, use the `isnull()` method.

In [99]:
df_miss.isnull()

     one    two  three   four
a  False  False  False  False
b   True  False  False  False
c  False  False  False  False
d   True   True   True   True
e  False  False  False  False
f  False   True   True  False

- How many missing values are there in the dataframe?

In [100]:
sum(df_miss.isnull()) # Built-in sum doesn't work

TypeError: unsupported operand type(s) for +: 'int' and 'str'

- Summing up the boolean array reports how many missing values are in each column.

In [118]:
np.sum(df_miss.isnull())

one      2
two      2
three    2
four     1
dtype: int64

- The same is possible for rows by setting the axis parameter to 1.

In [102]:
np.sum(df_miss.isnull(), axis=1)

a    0
b    1
c    0
d    4
e    0
f    2
dtype: int64

- To isolate the rows in which there are null values, aggregate the `df.isnull()` boolean data frame along rows, using `any` with `axis=1`.

In [119]:
mask=df_miss.isnull().any(axis=1)
mask

module

- Passing the boolean Series to the first position of the `loc` method of the DataFrame selects the rows that have value equal to True:

In [120]:
df_miss.loc[mask,:]

       one       two     three      four
b      NaN -0.217766  0.655179  1.379276
d      NaN       NaN       NaN       NaN
f -1.14906       NaN       NaN -0.160499

- Similarly, if you want to locate the rows that contains only missing values, you can use `all()`

In [124]:
mask=df_miss.isnull().all(axis=1)
mask = pd.isnull(df_miss).all(axis=1)
mask

a    False
b    False
c    False
d     True
e    False
f    False
dtype: bool

**Exercise 5**
- Handling NaNs has been shown, however, not all missing values are NaNs. Consider the example below:

```
Employee = pd.read_csv('Employee_continue.csv')
```

Print the data frame, looking for missing values by inspection. How many missing values are there? Some of the missing values might not be NaNs.

In [132]:
Employee = pd.read_csv('Employee_continue.csv')#, na_values=[np.nan,'?'])
Employee

  Department Education Sex      Title  Year      Name  Salary
0         IT  Bachelor   M    analyst   1.0       Bob    90.0
1         IT    Master   M    analyst   2.0      Jake    90.0
2         HR    Master   M    analyst   2.0      John    90.0
3         HR  Bachelor   F    analyst   2.0      Judy    90.0
4      Trade       PHD   M  associate   3.0       Sam   120.0
5          ?       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT         ?   F         VP   9.0      Mary   262.5

In [125]:
pd.read_csv?

- See '?' in the data frame. For a small data frame like this the '?' may be replaced by `np.nan` manually. In dealing with a large data frame, it is more efficient to use the function `replace`. Use `replace` to swap '?' with `np.nan`.

In [135]:
#### Your code here
Employee2 = Employee.replace(to_replace=['?',np.nan],value=np.nan)
Employee2.tail()

  Department Education Sex      Title  Year      Name  Salary
4      Trade       PHD   M  associate   3.0       Sam   120.0
5        NaN       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
7         HR    Master   M         VP   8.0     Peter   262.5
8         IT       NaN   F         VP   9.0      Mary   262.5

- How many missing values are there in each row? How many in each column?

In [136]:
#### Your code here
Employee2.isnull().sum(axis=1)
Employee2.isnull().sum(axis=0)

Department    1
Education     1
Sex           0
Title         0
Year          1
Name          0
Salary        0
dtype: int64

- Print the rows with missing values.

In [137]:
#### Your code here
missing_rows = Employee2.isnull().sum(axis=1)>0
Employee2.loc[missing_rows]

  Department Education Sex      Title  Year      Name  Salary
5        NaN       PHD   F  associate   5.0       Amy   120.0
6      Trade    Master   F  associate   NaN  Jennifer   120.0
8         IT       NaN   F         VP   9.0      Mary   262.5

- Print the columns with missing values.

In [110]:
#### Your code here
missing_columns = Employee2.isnull().sum(axis=0)>0
Employee2.loc[:,missing_columns]

  Department Education  Year
0         IT  Bachelor   1.0
1         IT    Master   2.0
2         HR    Master   2.0
3         HR  Bachelor   2.0
4      Trade       PHD   3.0
5        NaN       PHD   5.0
6      Trade    Master   NaN
7         HR    Master   8.0
8         IT       NaN   9.0

Once all the missing values are represented by `NaN`s, Pandas provides various methods for handling them:

<p><a name="dropna"></a></p>
## dropna
- One option is to discard the rows with missing values. Below the arguments `axis=0` and `how='any'` indicate dropping *rows* with a NaN in *any* position.

In [111]:
df_miss

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d       NaN       NaN       NaN       NaN
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

In [112]:
df_miss.dropna(axis=0, how='any')
df_miss.dropna?

- Another option is to drop rows full of NaNs. This can be done with `how='all'`.

In [113]:
df_miss.dropna(axis=0, how='all')

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

- Applying `dropna()` to the above data frame may be done once more. Drop a column with the argument `axis=1`.

In [114]:
df_miss.dropna(axis=0, how='all').dropna(axis=1, how='any')

       four
a -1.015682
b  1.379276
c  1.034417
e -0.492039
f -0.160499

<p><a name="fillna"></a></p>
## fillna

- An alternative to discarding information is to **impute** the data. 
- This can be done with the `fillna()` function with the value to be imputed as the argument.

In [115]:
df_miss.fillna(0)

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b  0.000000 -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d  0.000000  0.000000  0.000000  0.000000
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060  0.000000  0.000000 -0.160499

- Another common way to impute is by the mean of the column.

In [116]:
df_miss['one'].fillna(df_miss['one'].mean())

a   -1.250699
b   -0.795237
c   -0.860359
d   -0.795237
e    0.079169
f   -1.149060
Name: one, dtype: float64

<p><a name="interpolate"></a></p>
## Interpolate

- Interpolation is the insertion of new data between preeexisting fixed points. Linear interpolation uses a linear function to create new data point.  
- In pandas this is accomplished using `interpolate()` with the `method` parameter set to linear, `method='linear'`.  
- This will fill in missing data points with a linear interpolation between the data points bordering the missing values.

In [141]:
df_miss

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b       NaN -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d       NaN       NaN       NaN       NaN
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060       NaN       NaN -0.160499

In [118]:
df_miss.interpolate(method='linear')

        one       two     three      four
a -1.250699 -0.573801  0.705961 -1.015682
b -1.055529 -0.217766  0.655179  1.379276
c -0.860359 -1.313747  0.676174  1.034417
d -0.390595 -0.642305  0.457679  0.271189
e  0.079169  0.029138  0.239183 -0.492039
f -1.149060  0.029138  0.239183 -0.160499

- Since `df.loc['b','one']` is a NaN between `df.loc['a','one']` and `df.loc['c','one']`, the value inserted is the mean of them.
- Note how this technique treats NaN values at the bottom of a column.

In [139]:
(df_miss.loc['a', 'one'] + df_miss.loc['c', 'one'])/2

-1.055528936449

<p><a name="grouping"></a></p>

# Grouping and Aggregation

Grouping and  aggregation are critical components of data analysis which involve:

- **Splitting** data into groups based on some features.
- **Applying** a function to each group independently.
- **Combining** the result into data structure.

### Grouping

Grouping splits a data frame into categorical groups, according to a given variable, or set of variables.   Consider the following data frame.

In [142]:
Country = pd.read_csv('countries.csv', delimiter=';')
Country.head()

,Country,Country (de),Country (local),Country code,Continent,Capital,Population,Area,Coastline,Government form,Currency,Currency code,Dialing prefix,Birthrate,Deathrate,Life expectancy,Url
0,Afghanistan,Afghanistan,Afganistan/Afqanestan,AF,Asia,Kabul,33332025,652230,0,Presidential islamic republic,Afghani,AFN,93,38.3,13.7,51.3,https://www.laenderdaten.info/Asien/Afghanista...
1,Egypt,Ägypten,Misr,EG,Africa,Cairo,94666993,1001450,2450,Presidential republic,Pfund,EGP,20,30.3,4.7,72.7,https://www.laenderdaten.info/Afrika/Aegypten/...
2,Åland Islands,Ålandinseln,Åland,AX,Europe,Mariehamn,29013,1580,0,Autonomous region of Finland,Euro,EUR,358,0.0,0.0,0.0,https://www.laenderdaten.info/Europa/Aland/ind...
3,Albania,Albanien,Shqipëria,AL,Europe,Tirana,3038594,28748,362,parliamentary republic,Lek,ALL,355,13.1,6.7,78.3,https://www.laenderdaten.info/Europa/Albanien/...
4,Algeria,Algerien,Al-Jaza’ir/Algérie,DZ,Africa,Algiers,40263711,2381741,998,Presidential republic,Dinar,DZD,213,23.0,4.3,76.8,https://www.laenderdaten.info/Afrika/Algerien/...

In [144]:
#choose the desires columns
Country=Country[['Country','Continent','Population','Area','Coastline',
                'Currency','Birthrate','Deathrate','Life expectancy']]
#change the column names to lowercase
Country.columns = Country.columns.str.lower()
#drop columns with missing values (Antarctica)
Country=Country.dropna(axis=0, how='any')
#limit to countries with populations over 20 million
Country=Country[Country['population']>20e6]
#add a boolean valued column that is true for countries with coastlines
Country['coastal']=Country['coastline']!=0
Country

,country,continent,population,area,coastline,currency,birthrate,deathrate,life expectancy,coastal
0,Afghanistan,Asia,33332025,652230,0,Afghani,38.3,13.7,51.3,False
1,Egypt,Africa,94666993,1001450,2450,Pfund,30.3,4.7,72.7,True
4,Algeria,Africa,40263711,2381741,998,Dinar,23.0,4.3,76.8,True
7,Angola,Africa,20172332,1246700,1600,Kwanza,38.6,11.3,56.0,True
12,Argentina,South America,43886748,2780400,4989,Peso,17.0,7.5,77.1,True
16,Ethiopia,Africa,102374044,1104300,0,Birr,36.9,7.9,62.2,False
17,Australia,Australia,22992654,7741220,25760,Dollar,12.1,7.2,82.2,True
20,Bangladesh,Asia,156186882,143998,580,Taka,19.0,5.3,73.2,True
32,Brazil,South America,205823665,8514877,7491,Real,14.3,6.6,73.8,True
39,China,Asia,1373541278,9596960,14500,Yuan,12.4,7.7,75.5,True
44,Democratic Republic of the Congo,Africa,81331050,2344858,37,Franc,34.2,9.9,57.3,True
45,Germany,Europe,80722792,357022,2389,Euro,8.5,11.6,80.7,True
51,Ivory Coast,Africa,23740424,322463,515,Franc,28.2,9.5,58.7,True
58,France,Europe,66836154,643801,3427,Euro,12.3,9.3,81.8,True
65,Ghana,Africa,26908262,238533,539,Ghana Cedi,30.8,7.1,66.6,True
81,India,Asia,1266883598,3287263,7000,Rupie,19.3,7.3,68.5,True
82,Indonesia,Asia,258316051,1904569,54716,Rupiah,16.4,6.4,72.7,True
84,Iraq,Asia,38146025,438317,58,Dinar,30.9,3.8,74.9,True
85,Iran,Asia,82801633,1648195,2440,Rial,17.8,5.9,71.4,True
89,Italy,Europe,62007540,301340,7600,Euro,8.7,10.3,82.2,True
91,Japan,Asia,126702133,377915,29751,Yen,7.8,9.6,85.0,True
92,Yemen,Asia,27392779,527968,1906,Rial,29.2,6.1,65.5,True
99,Cameroon,Africa,24360803,475440,402,Franc,35.8,9.8,58.5,True
100,Canada,North America,35362905,9984670,202080,Dollar,10.3,8.5,81.9,True
104,Kenya,Africa,46790758,580367,536,Schilling,25.1,6.8,64.0,True
108,Colombia,South America,47220856,1138910,3208,Peso,16.3,5.4,75.7,True
125,Madagascar,Africa,24430325,587041,4828,Ariary,32.1,6.7,65.9,True
127,Malaysia,Asia,30949962,329847,4675,Ringgit,19.4,5.1,75.0,True
131,Morocco,Africa,33655786,446550,1835,Dirham,18.0,4.8,76.9,True
138,Mexico,North America,123166749,1964375,9330,Peso,18.5,5.3,75.9,True
145,Mozambique,Africa,25930150,799380,2470,Metical,38.3,11.9,53.3,True
146,Burma,Asia,56890418,676578,1930,Kyat,18.2,7.9,66.6,True
149,Nepal,Asia,29033914,147181,0,Rupie,19.9,5.7,70.7,False
156,Nigeria,Africa,186053386,923768,853,Naira,37.3,12.7,53.4,True
158,North Korea,Asia,25115311,120538,2495,Won,14.6,9.3,70.4,True
165,Pakistan,Asia,201995540,796095,1046,Rupie,22.3,6.4,67.7,True
171,Peru,South America,30741062,1285216,2414,Nuevo Sol,18.0,6.0,73.7,True
172,Philippines,Asia,102624209,300000,36289,Peso,24.0,6.1,69.2,True
174,Poland,Europe,38523261,312685,440,Zloty,9.6,10.3,77.6,True
179,Romania,Europe,21599736,238391,225,Leu,9.0,11.9,75.1,True
180,Russia,Europe,142355415,17098242,37653,Rubel,11.3,13.6,70.8,True
187,Saudi Arabia,Asia,28160273,2149690,2640,Riyal,18.4,3.3,75.3,True
200,Spain,Europe,48563476,505370,4964,Euro,9.4,9.1,81.7,True
201,Sri Lanka,Asia,22235000,65610,1340,Rupie,15.5,6.2,76.8,True
207,South Africa,Africa,54300704,1219090,2798,Rand,20.5,9.6,63.1,True
208,Sudan,Africa,36729501,1861484,853,Pfund,28.5,7.5,64.1,True
210,South Korea,Asia,50924172,99720,2413,Won,8.4,5.8,82.4,True
217,Taiwan,Asia,23464787,35980,1566,Dollar,8.4,7.3,80.1,True
218,Tanzania,Africa,52482726,947300,1424,Schilling,36.0,7.8,62.2,True
219,Thailand,Asia,68200824,513120,3219,Baht,11.1,7.9,74.7,True
227,Turkey,Asia,80274604,783562,7200,Lira,16.0,5.9,74.8,True
231,Uganda,Africa,38319241,241038,0,Schilling,43.4,10.4,55.4,False
232,Ukraine,Europe,44209733,603550,2782,Hrywnja,10.5,14.4,71.8,True
235,Uzbekistan,Asia,29473614,447400,0,So'm,16.9,5.3,73.8,False
238,Venezuela,South America,30912302,912050,2800,Bolívar Fuerte,19.2,5.2,75.8,True
240,United States,North America,323995528,9826675,19924,Dollar,12.5,8.2,79.8,True
241,United Kingdom,Europe,64430428,243610,12429,Pfund,12.1,9.4,80.7,True
242,Vietnam,Asia,95261021,331210,3444,Dong,15.7,5.9,73.4,True

- This will calculate the mean population.

In [145]:
Country['population'].mean()

112995987.12068966

- This will calculate the sum of all populations in Asia.

In [123]:
Country[Country['continent']=='Asia']['population'].sum()

4207906053

- This will return the number of land-locked countries in the data frame.

In [124]:
Country[Country['coastal']==False].country.count()

5

- To group the countries by continent, do the following:

In [147]:
group = Country.groupby('continent')
dir(group)[-60:-30]

['corr',
 'corrwith',
 'count',
 'country',
 'cov',
 'cumcount',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'currency',
 'deathrate',
 'describe',
 'diff',
 'dtypes',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'get_group',
 'groups',
 'head',
 'hist',
 'idxmax',
 'idxmin',
 'indices',
 'last',
 'mad',
 'max']

- `group` is assigned the value returned by the `groupby` function, whose type is:

In [126]:
print(type(group))

<class 'pandas.core.groupby.DataFrameGroupBy'>

- The `DataFrameGroupBy` object is an `iterable`. Iterate over the object and print the contents, as follows:

In [127]:
for item in group:
    print(item)

('Africa',                               country continent  population     area  \
1                               Egypt    Africa    94666993  1001450
4                             Algeria    Africa    40263711  2381741
7                              Angola    Africa    20172332  1246700
16                           Ethiopia    Africa   102374044  1104300
44   Democratic Republic of the Congo    Africa    81331050  2344858
51                        Ivory Coast    Africa    23740424   322463
65                              Ghana    Africa    26908262   238533
99                           Cameroon    Africa    24360803   475440
104                             Kenya    Africa    46790758   580367
125                        Madagascar    Africa    24430325   587041
131                           Morocco    Africa    33655786   446550
145                        Mozambique    Africa    25930150   799380
156                           Nigeria    Africa   186053386   923768
207                      South Africa    Africa    54300704  1219090
208                             Sudan    Africa    36729501  1861484
218                          Tanzania    Africa    52482726   947300
231                            Uganda    Africa    38319241   241038

     coastline    currency  birthrate  deathrate  life expectancy  coastal
1         2450       Pfund       30.3        4.7             72.7     True
4          998       Dinar       23.0        4.3             76.8     True
7         1600      Kwanza       38.6       11.3             56.0     True
16           0        Birr       36.9        7.9             62.2    False
44          37       Franc       34.2        9.9             57.3     True
51         515       Franc       28.2        9.5             58.7     True
65         539  Ghana Cedi       30.8        7.1             66.6     True
99         402       Franc       35.8        9.8             58.5     True
104        536   Schilling       25.1        6.8             64.0     True
125       4828      Ariary       32.1        6.7             65.9     True
131       1835      Dirham       18.0        4.8             76.9     True
145       2470     Metical       38.3       11.9             53.3     True
156        853       Naira       37.3       12.7             53.4     True
207       2798        Rand       20.5        9.6             63.1     True
208        853       Pfund       28.5        7.5             64.1     True
218       1424   Schilling       36.0        7.8             62.2     True
231          0   Schilling       43.4       10.4             55.4    False  )
('Asia',           country continent  population     area  coastline currency  \
0     Afghanistan      Asia    33332025   652230          0  Afghani
20     Bangladesh      Asia   156186882   143998        580     Taka
39          China      Asia  1373541278  9596960      14500     Yuan
81          India      Asia  1266883598  3287263       7000    Rupie
82      Indonesia      Asia   258316051  1904569      54716   Rupiah
84           Iraq      Asia    38146025   438317         58    Dinar
85           Iran      Asia    82801633  1648195       2440     Rial
91          Japan      Asia   126702133   377915      29751      Yen
92          Yemen      Asia    27392779   527968       1906     Rial
127      Malaysia      Asia    30949962   329847       4675  Ringgit
146         Burma      Asia    56890418   676578       1930     Kyat
149         Nepal      Asia    29033914   147181          0    Rupie
158   North Korea      Asia    25115311   120538       2495      Won
165      Pakistan      Asia   201995540   796095       1046    Rupie
172   Philippines      Asia   102624209   300000      36289     Peso
187  Saudi Arabia      Asia    28160273  2149690       2640    Riyal
201     Sri Lanka      Asia    22235000    65610       1340    Rupie
210   South Korea      Asia    50924172    99720       2413      Won
217        Taiwan      Asia    23464787    35980       1566   Dollar
219      Thailand      Asia    68200824   513120       3219     Baht
227        Turkey      Asia    80274604   783562       7200     Lira
235    Uzbekistan      Asia    29473614   447400          0     So'm
242       Vietnam      Asia    95261021   331210       3444     Dong

     birthrate  deathrate  life expectancy  coastal
0         38.3       13.7             51.3    False
20        19.0        5.3             73.2     True
39        12.4        7.7             75.5     True
81        19.3        7.3             68.5     True
82        16.4        6.4             72.7     True
84        30.9        3.8             74.9     True
85        17.8        5.9             71.4     True
91         7.8        9.6             85.0     True
92        29.2        6.1             65.5     True
127       19.4        5.1             75.0     True
146       18.2        7.9             66.6     True
149       19.9        5.7             70.7    False
158       14.6        9.3             70.4     True
165       22.3        6.4             67.7     True
172       24.0        6.1             69.2     True
187       18.4        3.3             75.3     True
201       15.5        6.2             76.8     True
210        8.4        5.8             82.4     True
217        8.4        7.3             80.1     True
219       11.1        7.9             74.7     True
227       16.0        5.9             74.8     True
235       16.9        5.3             73.8    False
242       15.7        5.9             73.4     True  )
('Australia',       country  continent  population     area  coastline currency  birthrate  \
17  Australia  Australia    22992654  7741220      25760   Dollar       12.1

    deathrate  life expectancy  coastal
17        7.2             82.2     True  )
('Europe',             country continent  population      area  coastline currency  \
45          Germany    Europe    80722792    357022       2389     Euro
58           France    Europe    66836154    643801       3427     Euro
89            Italy    Europe    62007540    301340       7600     Euro
174          Poland    Europe    38523261    312685        440    Zloty
179         Romania    Europe    21599736    238391        225      Leu
180          Russia    Europe   142355415  17098242      37653    Rubel
200           Spain    Europe    48563476    505370       4964     Euro
232         Ukraine    Europe    44209733    603550       2782  Hrywnja
241  United Kingdom    Europe    64430428    243610      12429    Pfund

     birthrate  deathrate  life expectancy  coastal
45         8.5       11.6             80.7     True
58        12.3        9.3             81.8     True
89         8.7       10.3             82.2     True
174        9.6       10.3             77.6     True
179        9.0       11.9             75.1     True
180       11.3       13.6             70.8     True
200        9.4        9.1             81.7     True
232       10.5       14.4             71.8     True
241       12.1        9.4             80.7     True  )
('North America',            country      continent  population     area  coastline currency  \
100         Canada  North America    35362905  9984670     202080   Dollar
138         Mexico  North America   123166749  1964375       9330     Peso
240  United States  North America   323995528  9826675      19924   Dollar

     birthrate  deathrate  life expectancy  coastal
100       10.3        8.5             81.9     True
138       18.5        5.3             75.9     True
240       12.5        8.2             79.8     True  )
('South America',        country      continent  population     area  coastline        currency  \
12   Argentina  South America    43886748  2780400       4989            Peso
32      Brazil  South America   205823665  8514877       7491            Real
108   Colombia  South America    47220856  1138910       3208            Peso
171       Peru  South America    30741062  1285216       2414       Nuevo Sol
238  Venezuela  South America    30912302   912050       2800  Bolívar Fuerte

     birthrate  deathrate  life expectancy  coastal
12        17.0        7.5             77.1     True
32        14.3        6.6             73.8     True
108       16.3        5.4             75.7     True
171       18.0        6.0             73.7     True
238       19.2        5.2             75.8     True  )

- Each `item` we print is a two element `tuple`. The first element is the grouping.  
- The second element is a data frame for that grouping. There is an alternative way of iterating through the groupby object, as follows:

In [128]:
for key, values in group:
    print(key) #this indicates the grouping
    print('-'*70)
    print(values) #this is a dataframe for that 
    print('\n')

Africa
----------------------------------------------------------------------
                              country continent  population     area  \
1                               Egypt    Africa    94666993  1001450
4                             Algeria    Africa    40263711  2381741
7                              Angola    Africa    20172332  1246700
16                           Ethiopia    Africa   102374044  1104300
44   Democratic Republic of the Congo    Africa    81331050  2344858
51                        Ivory Coast    Africa    23740424   322463
65                              Ghana    Africa    26908262   238533
99                           Cameroon    Africa    24360803   475440
104                             Kenya    Africa    46790758   580367
125                        Madagascar    Africa    24430325   587041
131                           Morocco    Africa    33655786   446550
145                        Mozambique    Africa    25930150   799380
156                           Nigeria    Africa   186053386   923768
207                      South Africa    Africa    54300704  1219090
208                             Sudan    Africa    36729501  1861484
218                          Tanzania    Africa    52482726   947300
231                            Uganda    Africa    38319241   241038

     coastline    currency  birthrate  deathrate  life expectancy  coastal
1         2450       Pfund       30.3        4.7             72.7     True
4          998       Dinar       23.0        4.3             76.8     True
7         1600      Kwanza       38.6       11.3             56.0     True
16           0        Birr       36.9        7.9             62.2    False
44          37       Franc       34.2        9.9             57.3     True
51         515       Franc       28.2        9.5             58.7     True
65         539  Ghana Cedi       30.8        7.1             66.6     True
99         402       Franc       35.8        9.8             58.5     True
104        536   Schilling       25.1        6.8             64.0     True
125       4828      Ariary       32.1        6.7             65.9     True
131       1835      Dirham       18.0        4.8             76.9     True
145       2470     Metical       38.3       11.9             53.3     True
156        853       Naira       37.3       12.7             53.4     True
207       2798        Rand       20.5        9.6             63.1     True
208        853       Pfund       28.5        7.5             64.1     True
218       1424   Schilling       36.0        7.8             62.2     True
231          0   Schilling       43.4       10.4             55.4    False


Asia
----------------------------------------------------------------------
          country continent  population     area  coastline currency  \
0     Afghanistan      Asia    33332025   652230          0  Afghani
20     Bangladesh      Asia   156186882   143998        580     Taka
39          China      Asia  1373541278  9596960      14500     Yuan
81          India      Asia  1266883598  3287263       7000    Rupie
82      Indonesia      Asia   258316051  1904569      54716   Rupiah
84           Iraq      Asia    38146025   438317         58    Dinar
85           Iran      Asia    82801633  1648195       2440     Rial
91          Japan      Asia   126702133   377915      29751      Yen
92          Yemen      Asia    27392779   527968       1906     Rial
127      Malaysia      Asia    30949962   329847       4675  Ringgit
146         Burma      Asia    56890418   676578       1930     Kyat
149         Nepal      Asia    29033914   147181          0    Rupie
158   North Korea      Asia    25115311   120538       2495      Won
165      Pakistan      Asia   201995540   796095       1046    Rupie
172   Philippines      Asia   102624209   300000      36289     Peso
187  Saudi Arabia      Asia    28160273  2149690       2640    Riyal
201     Sri Lanka      Asia    22235000    65610       1340    Rupie
210   South Korea      Asia    50924172    99720       2413      Won
217        Taiwan      Asia    23464787    35980       1566   Dollar
219      Thailand      Asia    68200824   513120       3219     Baht
227        Turkey      Asia    80274604   783562       7200     Lira
235    Uzbekistan      Asia    29473614   447400          0     So'm
242       Vietnam      Asia    95261021   331210       3444     Dong

     birthrate  deathrate  life expectancy  coastal
0         38.3       13.7             51.3    False
20        19.0        5.3             73.2     True
39        12.4        7.7             75.5     True
81        19.3        7.3             68.5     True
82        16.4        6.4             72.7     True
84        30.9        3.8             74.9     True
85        17.8        5.9             71.4     True
91         7.8        9.6             85.0     True
92        29.2        6.1             65.5     True
127       19.4        5.1             75.0     True
146       18.2        7.9             66.6     True
149       19.9        5.7             70.7    False
158       14.6        9.3             70.4     True
165       22.3        6.4             67.7     True
172       24.0        6.1             69.2     True
187       18.4        3.3             75.3     True
201       15.5        6.2             76.8     True
210        8.4        5.8             82.4     True
217        8.4        7.3             80.1     True
219       11.1        7.9             74.7     True
227       16.0        5.9             74.8     True
235       16.9        5.3             73.8    False
242       15.7        5.9             73.4     True


Australia
----------------------------------------------------------------------
      country  continent  population     area  coastline currency  birthrate  \
17  Australia  Australia    22992654  7741220      25760   Dollar       12.1

    deathrate  life expectancy  coastal
17        7.2             82.2     True


Europe
----------------------------------------------------------------------
            country continent  population      area  coastline currency  \
45          Germany    Europe    80722792    357022       2389     Euro
58           France    Europe    66836154    643801       3427     Euro
89            Italy    Europe    62007540    301340       7600     Euro
174          Poland    Europe    38523261    312685        440    Zloty
179         Romania    Europe    21599736    238391        225      Leu
180          Russia    Europe   142355415  17098242      37653    Rubel
200           Spain    Europe    48563476    505370       4964     Euro
232         Ukraine    Europe    44209733    603550       2782  Hrywnja
241  United Kingdom    Europe    64430428    243610      12429    Pfund

     birthrate  deathrate  life expectancy  coastal
45         8.5       11.6             80.7     True
58        12.3        9.3             81.8     True
89         8.7       10.3             82.2     True
174        9.6       10.3             77.6     True
179        9.0       11.9             75.1     True
180       11.3       13.6             70.8     True
200        9.4        9.1             81.7     True
232       10.5       14.4             71.8     True
241       12.1        9.4             80.7     True


North America
----------------------------------------------------------------------
           country      continent  population     area  coastline currency  \
100         Canada  North America    35362905  9984670     202080   Dollar
138         Mexico  North America   123166749  1964375       9330     Peso
240  United States  North America   323995528  9826675      19924   Dollar

     birthrate  deathrate  life expectancy  coastal
100       10.3        8.5             81.9     True
138       18.5        5.3             75.9     True
240       12.5        8.2             79.8     True


South America
----------------------------------------------------------------------
       country      continent  population     area  coastline        currency  \
12   Argentina  South America    43886748  2780400       4989            Peso
32      Brazil  South America   205823665  8514877       7491            Real
108   Colombia  South America    47220856  1138910       3208            Peso
171       Peru  South America    30741062  1285216       2414       Nuevo Sol
238  Venezuela  South America    30912302   912050       2800  Bolívar Fuerte

     birthrate  deathrate  life expectancy  coastal
12        17.0        7.5             77.1     True
32        14.3        6.6             73.8     True
108       16.3        5.4             75.7     True
171       18.0        6.0             73.7     True
238       19.2        5.2             75.8     True

- This is a great way to print and inspect a `DataFrameGroupBy` object. Above was an example of **splitting**.
- The size function includes the number of elements in each grouping.

In [146]:
group.size()

NameError: name 'group' is not defined

- The following will return a data frame with the mean values for every coulumn in every grouping.

In [130]:
group.mean()

,population,area,coastline,birthrate,deathrate,life expectancy,coastal
continent,,,,,,,
Africa,5.367707e+07,9.836178e+05,1302.235294,31.588235,8.394118,62.770588,0.882353
Asia,1.829524e+08,1.103215e+06,7791.652174,18.256522,6.691304,72.560870,0.869565
Australia,2.299265e+07,7.741220e+06,25760.000000,12.100000,7.200000,82.200000,1.000000
Europe,6.324984e+07,2.256001e+06,7989.888889,10.155556,11.100000,78.044444,1.000000
North America,1.608417e+08,7.258573e+06,77111.333333,13.766667,7.333333,79.200000,1.000000
South America,7.171693e+07,2.926291e+06,4180.400000,16.960000,6.140000,75.220000,1.000000

- If you just want the mean of one specific column.

In [149]:
group.birthrate.mean()
# group[['birthrate']].mean() # This returns a data frame
group.birthrate?

### Aggregration

- The data frame can be grouped by multiple keys:

In [150]:
group2 = Country.groupby(['continent', 'currency'])

In [133]:
for key, values in group2:
    print(key)
    print('-'*70)
    print(values)
    print('\n')

('Africa', 'Ariary')
----------------------------------------------------------------------
        country continent  population    area  coastline currency  birthrate  \
125  Madagascar    Africa    24430325  587041       4828   Ariary       32.1

     deathrate  life expectancy  coastal
125        6.7             65.9     True


('Africa', 'Birr')
----------------------------------------------------------------------
     country continent  population     area  coastline currency  birthrate  \
16  Ethiopia    Africa   102374044  1104300          0     Birr       36.9

    deathrate  life expectancy  coastal
16        7.9             62.2    False


('Africa', 'Dinar')
----------------------------------------------------------------------
   country continent  population     area  coastline currency  birthrate  \
4  Algeria    Africa    40263711  2381741        998    Dinar       23.0

   deathrate  life expectancy  coastal
4        4.3             76.8     True


('Africa', 'Dirham')
----------------------------------------------------------------------
     country continent  population    area  coastline currency  birthrate  \
131  Morocco    Africa    33655786  446550       1835   Dirham       18.0

     deathrate  life expectancy  coastal
131        4.8             76.9     True


('Africa', 'Franc')
----------------------------------------------------------------------
                             country continent  population     area  \
44  Democratic Republic of the Congo    Africa    81331050  2344858
51                       Ivory Coast    Africa    23740424   322463
99                          Cameroon    Africa    24360803   475440

    coastline currency  birthrate  deathrate  life expectancy  coastal
44         37    Franc       34.2        9.9             57.3     True
51        515    Franc       28.2        9.5             58.7     True
99        402    Franc       35.8        9.8             58.5     True


('Africa', 'Ghana Cedi')
----------------------------------------------------------------------
   country continent  population    area  coastline    currency  birthrate  \
65   Ghana    Africa    26908262  238533        539  Ghana Cedi       30.8

    deathrate  life expectancy  coastal
65        7.1             66.6     True


('Africa', 'Kwanza')
----------------------------------------------------------------------
  country continent  population     area  coastline currency  birthrate  \
7  Angola    Africa    20172332  1246700       1600   Kwanza       38.6

   deathrate  life expectancy  coastal
7       11.3             56.0     True


('Africa', 'Metical')
----------------------------------------------------------------------
        country continent  population    area  coastline currency  birthrate  \
145  Mozambique    Africa    25930150  799380       2470  Metical       38.3

     deathrate  life expectancy  coastal
145       11.9             53.3     True


('Africa', 'Naira')
----------------------------------------------------------------------
     country continent  population    area  coastline currency  birthrate  \
156  Nigeria    Africa   186053386  923768        853    Naira       37.3

     deathrate  life expectancy  coastal
156       12.7             53.4     True


('Africa', 'Pfund')
----------------------------------------------------------------------
    country continent  population     area  coastline currency  birthrate  \
1     Egypt    Africa    94666993  1001450       2450    Pfund       30.3
208   Sudan    Africa    36729501  1861484        853    Pfund       28.5

     deathrate  life expectancy  coastal
1          4.7             72.7     True
208        7.5             64.1     True


('Africa', 'Rand')
----------------------------------------------------------------------
          country continent  population     area  coastline currency  \
207  South Africa    Africa    54300704  1219090       2798     Rand

     birthrate  deathrate  life expectancy  coastal
207       20.5        9.6             63.1     True


('Africa', 'Schilling')
----------------------------------------------------------------------
      country continent  population    area  coastline   currency  birthrate  \
104     Kenya    Africa    46790758  580367        536  Schilling       25.1
218  Tanzania    Africa    52482726  947300       1424  Schilling       36.0
231    Uganda    Africa    38319241  241038          0  Schilling       43.4

     deathrate  life expectancy  coastal
104        6.8             64.0     True
218        7.8             62.2     True
231       10.4             55.4    False


('Asia', 'Afghani')
----------------------------------------------------------------------
       country continent  population    area  coastline currency  birthrate  \
0  Afghanistan      Asia    33332025  652230          0  Afghani       38.3

   deathrate  life expectancy  coastal
0       13.7             51.3    False


('Asia', 'Baht')
----------------------------------------------------------------------
      country continent  population    area  coastline currency  birthrate  \
219  Thailand      Asia    68200824  513120       3219     Baht       11.1

     deathrate  life expectancy  coastal
219        7.9             74.7     True


('Asia', 'Dinar')
----------------------------------------------------------------------
   country continent  population    area  coastline currency  birthrate  \
84    Iraq      Asia    38146025  438317         58    Dinar       30.9

    deathrate  life expectancy  coastal
84        3.8             74.9     True


('Asia', 'Dollar')
----------------------------------------------------------------------
    country continent  population   area  coastline currency  birthrate  \
217  Taiwan      Asia    23464787  35980       1566   Dollar        8.4

     deathrate  life expectancy  coastal
217        7.3             80.1     True


('Asia', 'Dong')
----------------------------------------------------------------------
     country continent  population    area  coastline currency  birthrate  \
242  Vietnam      Asia    95261021  331210       3444     Dong       15.7

     deathrate  life expectancy  coastal
242        5.9             73.4     True


('Asia', 'Kyat')
----------------------------------------------------------------------
    country continent  population    area  coastline currency  birthrate  \
146   Burma      Asia    56890418  676578       1930     Kyat       18.2

     deathrate  life expectancy  coastal
146        7.9             66.6     True


('Asia', 'Lira')
----------------------------------------------------------------------
    country continent  population    area  coastline currency  birthrate  \
227  Turkey      Asia    80274604  783562       7200     Lira       16.0

     deathrate  life expectancy  coastal
227        5.9             74.8     True


('Asia', 'Peso')
----------------------------------------------------------------------
         country continent  population    area  coastline currency  birthrate  \
172  Philippines      Asia   102624209  300000      36289     Peso       24.0

     deathrate  life expectancy  coastal
172        6.1             69.2     True


('Asia', 'Rial')
----------------------------------------------------------------------
   country continent  population     area  coastline currency  birthrate  \
85    Iran      Asia    82801633  1648195       2440     Rial       17.8
92   Yemen      Asia    27392779   527968       1906     Rial       29.2

    deathrate  life expectancy  coastal
85        5.9             71.4     True
92        6.1             65.5     True


('Asia', 'Ringgit')
----------------------------------------------------------------------
      country continent  population    area  coastline currency  birthrate  \
127  Malaysia      Asia    30949962  329847       4675  Ringgit       19.4

     deathrate  life expectancy  coastal
127        5.1             75.0     True


('Asia', 'Riyal')
----------------------------------------------------------------------
          country continent  population     area  coastline currency  \
187  Saudi Arabia      Asia    28160273  2149690       2640    Riyal

     birthrate  deathrate  life expectancy  coastal
187       18.4        3.3             75.3     True


('Asia', 'Rupiah')
----------------------------------------------------------------------
      country continent  population     area  coastline currency  birthrate  \
82  Indonesia      Asia   258316051  1904569      54716   Rupiah       16.4

    deathrate  life expectancy  coastal
82        6.4             72.7     True


('Asia', 'Rupie')
----------------------------------------------------------------------
       country continent  population     area  coastline currency  birthrate  \
81       India      Asia  1266883598  3287263       7000    Rupie       19.3
149      Nepal      Asia    29033914   147181          0    Rupie       19.9
165   Pakistan      Asia   201995540   796095       1046    Rupie       22.3
201  Sri Lanka      Asia    22235000    65610       1340    Rupie       15.5

     deathrate  life expectancy  coastal
81         7.3             68.5     True
149        5.7             70.7    False
165        6.4             67.7     True
201        6.2             76.8     True


('Asia', "So'm")
----------------------------------------------------------------------
        country continent  population    area  coastline currency  birthrate  \
235  Uzbekistan      Asia    29473614  447400          0     So'm       16.9

     deathrate  life expectancy  coastal
235        5.3             73.8    False


('Asia', 'Taka')
----------------------------------------------------------------------
       country continent  population    area  coastline currency  birthrate  \
20  Bangladesh      Asia   156186882  143998        580     Taka       19.0

    deathrate  life expectancy  coastal
20        5.3             73.2     True


('Asia', 'Won')
----------------------------------------------------------------------
         country continent  population    area  coastline currency  birthrate  \
158  North Korea      Asia    25115311  120538       2495      Won       14.6
210  South Korea      Asia    50924172   99720       2413      Won        8.4

     deathrate  life expectancy  coastal
158        9.3             70.4     True
210        5.8             82.4     True


('Asia', 'Yen')
----------------------------------------------------------------------
   country continent  population    area  coastline currency  birthrate  \
91   Japan      Asia   126702133  377915      29751      Yen        7.8

    deathrate  life expectancy  coastal
91        9.6             85.0     True


('Asia', 'Yuan')
----------------------------------------------------------------------
   country continent  population     area  coastline currency  birthrate  \
39   China      Asia  1373541278  9596960      14500     Yuan       12.4

    deathrate  life expectancy  coastal
39        7.7             75.5     True


('Australia', 'Dollar')
----------------------------------------------------------------------
      country  continent  population     area  coastline currency  birthrate  \
17  Australia  Australia    22992654  7741220      25760   Dollar       12.1

    deathrate  life expectancy  coastal
17        7.2             82.2     True


('Europe', 'Euro')
----------------------------------------------------------------------
     country continent  population    area  coastline currency  birthrate  \
45   Germany    Europe    80722792  357022       2389     Euro        8.5
58    France    Europe    66836154  643801       3427     Euro       12.3
89     Italy    Europe    62007540  301340       7600     Euro        8.7
200    Spain    Europe    48563476  505370       4964     Euro        9.4

     deathrate  life expectancy  coastal
45        11.6             80.7     True
58         9.3             81.8     True
89        10.3             82.2     True
200        9.1             81.7     True


('Europe', 'Hrywnja')
----------------------------------------------------------------------
     country continent  population    area  coastline currency  birthrate  \
232  Ukraine    Europe    44209733  603550       2782  Hrywnja       10.5

     deathrate  life expectancy  coastal
232       14.4             71.8     True


('Europe', 'Leu')
----------------------------------------------------------------------
     country continent  population    area  coastline currency  birthrate  \
179  Romania    Europe    21599736  238391        225      Leu        9.0

     deathrate  life expectancy  coastal
179       11.9             75.1     True


('Europe', 'Pfund')
----------------------------------------------------------------------
            country continent  population    area  coastline currency  \
241  United Kingdom    Europe    64430428  243610      12429    Pfund

     birthrate  deathrate  life expectancy  coastal
241       12.1        9.4             80.7     True


('Europe', 'Rubel')
----------------------------------------------------------------------
    country continent  population      area  coastline currency  birthrate  \
180  Russia    Europe   142355415  17098242      37653    Rubel       11.3

     deathrate  life expectancy  coastal
180       13.6             70.8     True


('Europe', 'Zloty')
----------------------------------------------------------------------
    country continent  population    area  coastline currency  birthrate  \
174  Poland    Europe    38523261  312685        440    Zloty        9.6

     deathrate  life expectancy  coastal
174       10.3             77.6     True


('North America', 'Dollar')
----------------------------------------------------------------------
           country      continent  population     area  coastline currency  \
100         Canada  North America    35362905  9984670     202080   Dollar
240  United States  North America   323995528  9826675      19924   Dollar

     birthrate  deathrate  life expectancy  coastal
100       10.3        8.5             81.9     True
240       12.5        8.2             79.8     True


('North America', 'Peso')
----------------------------------------------------------------------
    country      continent  population     area  coastline currency  \
138  Mexico  North America   123166749  1964375       9330     Peso

     birthrate  deathrate  life expectancy  coastal
138       18.5        5.3             75.9     True


('South America', 'Bolívar Fuerte')
----------------------------------------------------------------------
       country      continent  population    area  coastline        currency  \
238  Venezuela  South America    30912302  912050       2800  Bolívar Fuerte

     birthrate  deathrate  life expectancy  coastal
238       19.2        5.2             75.8     True


('South America', 'Nuevo Sol')
----------------------------------------------------------------------
    country      continent  population     area  coastline   currency  \
171    Peru  South America    30741062  1285216       2414  Nuevo Sol

     birthrate  deathrate  life expectancy  coastal
171       18.0        6.0             73.7     True


('South America', 'Peso')
----------------------------------------------------------------------
       country      continent  population     area  coastline currency  \
12   Argentina  South America    43886748  2780400       4989     Peso
108   Colombia  South America    47220856  1138910       3208     Peso

     birthrate  deathrate  life expectancy  coastal
12        17.0        7.5             77.1     True
108       16.3        5.4             75.7     True


('South America', 'Real')
----------------------------------------------------------------------
   country      continent  population     area  coastline currency  birthrate  \
32  Brazil  South America   205823665  8514877       7491     Real       14.3

    deathrate  life expectancy  coastal
32        6.6             73.8     True

In [134]:
group2.mean()

                                population          area      coastline  \
continent     currency
Africa        Ariary          2.443032e+07  5.870410e+05    4828.000000
              Birr            1.023740e+08  1.104300e+06       0.000000
              Dinar           4.026371e+07  2.381741e+06     998.000000
              Dirham          3.365579e+07  4.465500e+05    1835.000000
              Franc           4.314409e+07  1.047587e+06     318.000000
              Ghana Cedi      2.690826e+07  2.385330e+05     539.000000
              Kwanza          2.017233e+07  1.246700e+06    1600.000000
              Metical         2.593015e+07  7.993800e+05    2470.000000
              Naira           1.860534e+08  9.237680e+05     853.000000
              Pfund           6.569825e+07  1.431467e+06    1651.500000
              Rand            5.430070e+07  1.219090e+06    2798.000000
              Schilling       4.586424e+07  5.895683e+05     653.333333
Asia          Afghani         3.333202e+07  6.522300e+05       0.000000
              Baht            6.820082e+07  5.131200e+05    3219.000000
              Dinar           3.814602e+07  4.383170e+05      58.000000
              Dollar          2.346479e+07  3.598000e+04    1566.000000
              Dong            9.526102e+07  3.312100e+05    3444.000000
              Kyat            5.689042e+07  6.765780e+05    1930.000000
              Lira            8.027460e+07  7.835620e+05    7200.000000
              Peso            1.026242e+08  3.000000e+05   36289.000000
              Rial            5.509721e+07  1.088082e+06    2173.000000
              Ringgit         3.094996e+07  3.298470e+05    4675.000000
              Riyal           2.816027e+07  2.149690e+06    2640.000000
              Rupiah          2.583161e+08  1.904569e+06   54716.000000
              Rupie           3.800370e+08  1.074037e+06    2346.500000
              So'm            2.947361e+07  4.474000e+05       0.000000
              Taka            1.561869e+08  1.439980e+05     580.000000
              Won             3.801974e+07  1.101290e+05    2454.000000
              Yen             1.267021e+08  3.779150e+05   29751.000000
              Yuan            1.373541e+09  9.596960e+06   14500.000000
Australia     Dollar          2.299265e+07  7.741220e+06   25760.000000
Europe        Euro            6.453249e+07  4.518832e+05    4595.000000
              Hrywnja         4.420973e+07  6.035500e+05    2782.000000
              Leu             2.159974e+07  2.383910e+05     225.000000
              Pfund           6.443043e+07  2.436100e+05   12429.000000
              Rubel           1.423554e+08  1.709824e+07   37653.000000
              Zloty           3.852326e+07  3.126850e+05     440.000000
North America Dollar          1.796792e+08  9.905672e+06  111002.000000
              Peso            1.231667e+08  1.964375e+06    9330.000000
South America Bolívar Fuerte  3.091230e+07  9.120500e+05    2800.000000
              Nuevo Sol       3.074106e+07  1.285216e+06    2414.000000
              Peso            4.555380e+07  1.959655e+06    4098.500000
              Real            2.058237e+08  8.514877e+06    7491.000000

                              birthrate  deathrate  life expectancy   coastal
continent     currency
Africa        Ariary          32.100000   6.700000        65.900000  1.000000
              Birr            36.900000   7.900000        62.200000  0.000000
              Dinar           23.000000   4.300000        76.800000  1.000000
              Dirham          18.000000   4.800000        76.900000  1.000000
              Franc           32.733333   9.733333        58.166667  1.000000
              Ghana Cedi      30.800000   7.100000        66.600000  1.000000
              Kwanza          38.600000  11.300000        56.000000  1.000000
              Metical         38.300000  11.900000        53.300000  1.000000
              Naira           37.300000  12.700000        53.400000  1.000000
              Pfund           29.400000   6.100000        68.400000  1.000000
              Rand            20.500000   9.600000        63.100000  1.000000
              Schilling       34.833333   8.333333        60.533333  0.666667
Asia          Afghani         38.300000  13.700000        51.300000  0.000000
              Baht            11.100000   7.900000        74.700000  1.000000
              Dinar           30.900000   3.800000        74.900000  1.000000
              Dollar           8.400000   7.300000        80.100000  1.000000
              Dong            15.700000   5.900000        73.400000  1.000000
              Kyat            18.200000   7.900000        66.600000  1.000000
              Lira            16.000000   5.900000        74.800000  1.000000
              Peso            24.000000   6.100000        69.200000  1.000000
              Rial            23.500000   6.000000        68.450000  1.000000
              Ringgit         19.400000   5.100000        75.000000  1.000000
              Riyal           18.400000   3.300000        75.300000  1.000000
              Rupiah          16.400000   6.400000        72.700000  1.000000
              Rupie           19.250000   6.400000        70.925000  0.750000
              So'm            16.900000   5.300000        73.800000  0.000000
              Taka            19.000000   5.300000        73.200000  1.000000
              Won             11.500000   7.550000        76.400000  1.000000
              Yen              7.800000   9.600000        85.000000  1.000000
              Yuan            12.400000   7.700000        75.500000  1.000000
Australia     Dollar          12.100000   7.200000        82.200000  1.000000
Europe        Euro             9.725000  10.075000        81.600000  1.000000
              Hrywnja         10.500000  14.400000        71.800000  1.000000
              Leu              9.000000  11.900000        75.100000  1.000000
              Pfund           12.100000   9.400000        80.700000  1.000000
              Rubel           11.300000  13.600000        70.800000  1.000000
              Zloty            9.600000  10.300000        77.600000  1.000000
North America Dollar          11.400000   8.350000        80.850000  1.000000
              Peso            18.500000   5.300000        75.900000  1.000000
South America Bolívar Fuerte  19.200000   5.200000        75.800000  1.000000
              Nuevo Sol       18.000000   6.000000        73.700000  1.000000
              Peso            16.650000   6.450000        76.400000  1.000000
              Real            14.300000   6.600000        73.800000  1.000000

- Apply multiple functions to each group with the method `agg()`:

In [135]:
group.agg(['count', 'sum', 'min', 'max', 'mean', 'std'])

              population                                                  \
                   count         sum       min         max          mean
continent
Africa                17   912510196  20172332   186053386  5.367707e+07
Asia                  23  4207906053  22235000  1373541278  1.829524e+08
Australia              1    22992654  22992654    22992654  2.299265e+07
Europe                 9   569248535  21599736   142355415  6.324984e+07
North America          3   482525182  35362905   323995528  1.608417e+08
South America          5   358584633  30741062   205823665  7.171693e+07

                             area                                 ...     \
                        std count       sum      min       max    ...
continent                                                         ...
Africa         4.236223e+07    17  16721503   238533   2381741    ...
Asia           3.644163e+08    23  25373946    35980   9596960    ...
Australia               NaN     1   7741220  7741220   7741220    ...
Europe         3.446582e+07     9  20304011   238391  17098242    ...
North America  1.479586e+08     3  21775720  1964375   9984670    ...
South America  7.533796e+07     5  14631453   912050   8514877    ...

              life expectancy                            coastal               \
                          min   max       mean       std   count   sum    min
continent
Africa                   53.3  76.9  62.770588  7.356780      17  15.0  False
Asia                     51.3  85.0  72.560870  6.621160      23  20.0  False
Australia                82.2  82.2  82.200000       NaN       1   1.0   True
Europe                   70.8  82.2  78.044444  4.460693       9   9.0   True
North America            75.9  81.9  79.200000  3.044667       3   3.0   True
South America            73.7  77.1  75.220000  1.451551       5   5.0   True


                max      mean       std
continent
Africa         True  0.882353  0.332106
Asia           True  0.869565  0.344350
Australia      True  1.000000       NaN
Europe         True  1.000000  0.000000
North America  True  1.000000  0.000000
South America  True  1.000000  0.000000

[6 rows x 42 columns]

- To look at a single column of the aggregate analysis, use the column indexing:

In [136]:
group.agg(['count', 'sum', 'min', 'max', 'mean', 'std'])['birthrate']

               count    sum   min   max       mean       std
continent
Africa            17  537.0  18.0  43.4  31.588235  7.007129
Asia              23  419.9   7.8  38.3  18.256522  7.272665
Australia          1   12.1  12.1  12.1  12.100000       NaN
Europe             9   91.4   8.5  12.3  10.155556  1.452680
North America      3   41.3  10.3  18.5  13.766667  4.244212
South America      5   84.8  14.3  19.2  16.960000  1.844722

- The column std is missing a value above because Australia only has one row in the data frame.
- Also note that `sum` is an inappropriate function to apply to birthrate where it would be applicable to population.

- Different aggregating functions can be applied to different columns. This can be done with a dictionary.

In [137]:
colFun = {'country':['count'],
          'population': ['sum','min', 'max','mean','std'], 
          'area': ['sum','min', 'max','mean'],
          'coastline':['sum','min', 'max'],
          'birthrate':['min', 'max','mean','std'],
          'deathrate':['min', 'max','mean','std'],
          'life expectancy':['min', 'max','mean','std']}
analysis=group.agg(colFun)
analysis

              country  population                                      \
                count         sum       min         max          mean
continent
Africa             17   912510196  20172332   186053386  5.367707e+07
Asia               23  4207906053  22235000  1373541278  1.829524e+08
Australia           1    22992654  22992654    22992654  2.299265e+07
Europe              9   569248535  21599736   142355415  6.324984e+07
North America       3   482525182  35362905   323995528  1.608417e+08
South America       5   358584633  30741062   205823665  7.171693e+07

                                 area                                   \
                        std       sum      min       max          mean
continent
Africa         4.236223e+07  16721503   238533   2381741  9.836178e+05
Asia           3.644163e+08  25373946    35980   9596960  1.103215e+06
Australia               NaN   7741220  7741220   7741220  7.741220e+06
Europe         3.446582e+07  20304011   238391  17098242  2.256001e+06
North America  1.479586e+08  21775720  1964375   9984670  7.258573e+06
South America  7.533796e+07  14631453   912050   8514877  2.926291e+06

                 ...    deathrate                      coastline         \
                 ...          max       mean       std       sum    min
continent        ...
Africa           ...         12.7   8.394118  2.525240     22138      0
Asia             ...         13.7   6.691304  2.133054    179208      0
Australia        ...          7.2   7.200000       NaN     25760  25760
Europe           ...         14.4  11.100000  1.918333     71909    225
North America    ...          8.5   7.333333  1.767295    231334   9330
South America    ...          7.5   6.140000  0.937017     20902   2414

                      birthrate
                  max       min   max       mean       std
continent
Africa           4828      18.0  43.4  31.588235  7.007129
Asia            54716       7.8  38.3  18.256522  7.272665
Australia       25760      12.1  12.1  12.100000       NaN
Europe          37653       8.5  12.3  10.155556  1.452680
North America  202080      10.3  18.5  13.766667  4.244212
South America    7491      14.3  19.2  16.960000  1.844722

[6 rows x 25 columns]

- Custom aggregation functions may also be applied. In the previous examples, aggregation functions are applied to each **column** in a data frame. 
- Keep this in mind when defining a custom function. For example, build a function that computes the mean after removing maxima (truncated mean).

In [138]:
def trunc_mean(x):    # x has to be a 'vector' (1d array or pandas Series)
    sec=x[x!=x.max()]
    if sec.shape[0]!=0:
        return np.mean(sec)

In [139]:
Country[Country['country']!='Australia' ].groupby('continent').agg(trunc_mean)

,population,area,coastline,birthrate,deathrate,life expectancy,coastal
continent,,,,,,,
Africa,4.540355e+07,8.962351e+05,1081.875000,30.850000,8.125000,61.887500,0.0
Asia,1.288348e+08,7.171357e+05,5658.727273,17.345455,6.372727,71.995455,0.0
Europe,5.336164e+07,4.007211e+05,4282.000000,9.887500,10.687500,77.525000,NaN
North America,7.926483e+07,5.895525e+06,14627.000000,11.400000,6.750000,77.850000,NaN
South America,3.819024e+07,1.529144e+06,3352.750000,16.400000,5.800000,74.750000,NaN

**Exercise 6**

Using the data frame Country:

- Find the minimum and maximum of the 'life expectancy' for costal and landlocked countries.
- How many coastal and landlocked countries are in each continent? Determine the mean deathrate for coastal and landlocked countries in each continent.
- Create a new column measuring population density.  Determine the mean population density of all the countries.  Create a new column 'dense' that is True for countries with higher than average density and False for lower than average density.
- For each category of 'dense' compute the mean birthrate and the difference between the maximal birthrate and the minimal birthrate.

In [140]:
#### Your code here
print(Country.groupby('coastal')[['life expectancy']].agg(['min','max']))
print(Country.groupby(['coastal','continent']).count())
Country['density']=Country.population/Country.area
mean_density = Country['density'].mean()
Country['dense'] = Country.density > mean_density
diff_ = lambda t:max(t)-min(t) 
Country.groupby('dense')[['birthrate']].agg(['mean',diff_])

        life expectancy
                    min   max
coastal
False              51.3  73.8
True               53.3  85.0
                       country  population  area  coastline  currency  \
coastal continent
False   Africa               2           2     2          2         2
        Asia                 3           3     3          3         3
True    Africa              15          15    15         15        15
        Asia                20          20    20         20        20
        Australia            1           1     1          1         1
        Europe               9           9     9          9         9
        North America        3           3     3          3         3
        South America        5           5     5          5         5

                       birthrate  deathrate  life expectancy
coastal continent
False   Africa                 2          2                2
        Asia                   3          3                3
True    Africa                15         15               15
        Asia                  20         20               20
        Australia              1          1                1
        Europe                 9          9                9
        North America          3          3                3
        South America          5          5                5

       birthrate
            mean <lambda>
dense
False  21.687805     29.6
True   17.488235     35.6

<p><a name="time"></a></p>
# Time Series

We will use the NYSE data from [Kaggle](https://www.kaggle.com/dgawlik/nyse) to illustrate how to use the time series data structure in pandas.

There are two time series related csv files:
- prices.csv: raw, as-is daily prices. Most of data spans from 2010 to the end 2016, for companies new on stock market date range is shorter. There have been approx. 140 stock splits in that time, this set doesn't account for that.
- prices-split-adjusted.csv: same as prices, but there have been added adjustments for splits.

In [162]:
url_adjusted = 'https://graderdata.s3.amazonaws.com/prices-split-adjusted.csv'

### Your code here
split_adjusted_price = pd.read_csv(url_adjusted)

In [163]:
split_adjusted_price.head()

,date,symbol,open,close,low,high,volume
0,2016-01-05,WLTW,123.430000,125.839996,122.309998,126.250000,2163600.0
1,2016-01-06,WLTW,125.239998,119.980003,119.940002,125.540001,2386400.0
2,2016-01-07,WLTW,116.379997,114.949997,114.930000,119.739998,2489500.0
3,2016-01-08,WLTW,115.480003,116.620003,113.500000,117.440002,2006300.0
4,2016-01-11,WLTW,117.010002,114.970001,114.089996,117.330002,1408600.0

- The date column contains timestamps so we can use it as the index of our dataframe.

In [172]:
split_adjusted_price['date'] = pd.to_datetime(split_adjusted_price['date'])
split_adjusted_price.date#.dtype
split_adjusted_price = split_adjusted_price.set_index('date')

In [155]:
split_adjusted_price.head()

           symbol        open       close         low        high     volume
date
2016-01-05   WLTW  123.430000  125.839996  122.309998  126.250000  2163600.0
2016-01-06   WLTW  125.239998  119.980003  119.940002  125.540001  2386400.0
2016-01-07   WLTW  116.379997  114.949997  114.930000  119.739998  2489500.0
2016-01-08   WLTW  115.480003  116.620003  113.500000  117.440002  2006300.0
2016-01-11   WLTW  117.010002  114.970001  114.089996  117.330002  1408600.0

- Once it becomes datetime data type, we can extract the month, date, year or even the weekday easily.

In [174]:
split_adjusted_price.index.__class__

pandas.core.indexes.datetimes.DatetimeIndex

In [157]:
split_adjusted_price.index.month

Int64Index([ 1,  1,  1,  1,  1,  1,  1,  1,  1,  1,
            ...
            12, 12, 12, 12, 12, 12, 12, 12, 12, 12],
           dtype='int64', name='date', length=851264)

In [158]:
split_adjusted_price.index.dayofweek

Int64Index([1, 2, 3, 4, 0, 1, 2, 3, 4, 1,
            ...
            4, 4, 4, 4, 4, 4, 4, 4, 4, 4],
           dtype='int64', name='date', length=851264)

- You can also extract the observations within any time range.

In [159]:
# View all observations that occured in May 2016
split_adjusted_price.loc['5/2016']

           symbol        open       close         low        high      volume
date
2016-05-02   WLTW  125.440002  125.959999  124.800003  126.739998    734700.0
2016-05-03   WLTW  124.559998  126.269997  123.660004  126.430000   1304800.0
2016-05-04   WLTW  125.389999  126.559998  124.970001  126.779999   1597300.0
2016-05-05   WLTW  126.660004  127.660004  126.199997  127.790001   1917500.0
2016-05-06   WLTW  127.360001  121.559998  121.239998  127.360001   3221500.0
2016-05-09   WLTW  122.279999  123.440002  121.199997  123.639999    919800.0
2016-05-10   WLTW  123.889999  125.510002  122.809998  125.989998   1991600.0
2016-05-11   WLTW  125.699997  124.209999  124.070000  125.940002    594800.0
2016-05-12   WLTW  124.440002  123.889999  122.010002  124.570000    475800.0
2016-05-13   WLTW  123.910004  122.970001  122.750000  126.269997    715100.0
2016-05-16   WLTW  123.120003  123.910004  122.870003  124.610001    528500.0
2016-05-17   WLTW  123.400002  123.410004  121.139999  124.169998    580000.0
2016-05-18   WLTW  123.220001  125.269997  122.519997  125.400002    629700.0
2016-05-19   WLTW  124.519997  125.120003  122.690002  125.470001    598200.0
2016-05-20   WLTW  125.150002  125.570000  123.900002  125.769997    816700.0
2016-05-23   WLTW  125.480003  125.949997  124.760002  126.230003    640800.0
2016-05-24   WLTW  126.129997  126.620003  125.169998  127.080002    761100.0
2016-05-25   WLTW  127.080002  126.459999  125.940002  128.059998    462100.0
2016-05-26   WLTW  126.360001  126.610001  125.419998  126.980003    627000.0
2016-05-27   WLTW  126.510002  127.910004  126.120003  127.989998    722500.0
2016-05-31   WLTW  128.500000  128.020004  127.190002  128.690002   1384200.0
2016-05-02      A   41.200001   41.709999   41.130001   41.750000   1285300.0
2016-05-02    AAL   34.990002   34.430000   34.400002   35.169998   8829800.0
2016-05-02    AAP  156.339996  155.460007  152.690002  156.759995    861600.0
2016-05-02   AAPL   93.970001   93.639999   92.400002   94.080002  48160100.0
2016-05-02   ABBV   60.790001   61.439999   60.700001   62.000000   9512000.0
2016-05-02    ABC   85.190002   85.230003   84.510002   85.370003   1621400.0
2016-05-02    ABT   38.849998   38.849998   38.419998   39.119999  21292300.0
2016-05-02    ACN  112.900002  114.400002  112.309998  114.699997   2293900.0
2016-05-02   ADBE   94.290001   94.900002   93.809998   94.989998   2330600.0
...           ...         ...         ...         ...         ...         ...
2016-05-31     VZ   50.880001   50.900002   50.590000   51.160000  15834500.0
2016-05-31    WAT  137.720001  137.550003  136.649994  138.270004    708000.0
2016-05-31    WBA   76.940002   77.400002   76.650002   77.589996   5007500.0
2016-05-31    WDC   45.529999   46.540001   44.889999   46.549999   7898300.0
2016-05-31    WEC   59.540001   60.139999   59.529999   60.330002   2866500.0
2016-05-31    WFC   51.020000   50.720001   50.490002   51.189999  19725000.0
2016-05-31    WFM   31.959999   32.349998   31.820000   32.380001   6300000.0
2016-05-31    WHR  174.809998  174.619995  173.179993  174.940002    772600.0
2016-05-31     WM   61.340000   60.950001   60.599998   61.630001   3144100.0
2016-05-31    WMB   21.660000   22.160000   21.660000   23.000000  10498400.0
2016-05-31    WMT   70.580002   70.779999   70.480003   71.000000   8390200.0
2016-05-31    WRK   40.080002   39.610001   39.340000   40.110001   1516100.0
2016-05-31     WU   19.490000   19.450001   19.200001   19.510000   6046000.0
2016-05-31     WY   31.559999   31.500000   31.379999   31.719999   6074300.0
2016-05-31    WYN   67.500000   67.389999   67.059998   67.680000   1217600.0
2016-05-31   WYNN   96.400002   96.180000   95.699997   97.699997   2139100.0
2016-05-31    XEC  118.550003  116.279999  115.699997  119.199997   1187400.0
2016-05-31    XEL   40.910000   41.369999   40.750000   41.410000   4784400.0
2016-05-31     XL   34.549999   34.349998   34.169998   34.700001   3626200.0
2016-05-31   XLNX   47.450001   47.389999   46.860001   47.450001   2316400.0
2016-05-31    XOM   90.000000   89.019997   88.730003   90.199997  13178800.0
2016-05-31   XRAY   62.689999   62.160000   61.849998   62.689999   1670900.0
2016-05-31    XRX    9.850000    9.970000    9.820000    9.970000  11718300.0
2016-05-31    XYL   44.700001   44.660000   44.400002   44.799999   1256400.0
2016-05-31   YHOO   37.730000   37.939999   37.500000   38.080002  12873600.0
2016-05-31    YUM   59.130124   59.015100   58.842561   59.381742   6090400.0
2016-05-31    ZBH  122.910004  122.110001  121.269997  123.000000   2028900.0
2016-05-31   ZION   28.389999   28.020000   27.920000   28.480000   2272600.0
2016-05-31    ZTS   47.419998   47.419998   47.110001   47.709999   2804200.0
2016-05-31    AIV   42.869999   42.650002   42.380001   42.970001   1214200.0

[10500 rows x 6 columns]

In [149]:
# Observations between May 3rd and May 4th
split_adjusted_price['5/3/2016':'5/4/2016']

           symbol        open       close         low        high      volume
date
2016-05-03   WLTW  124.559998  126.269997  123.660004  126.430000   1304800.0
2016-05-04   WLTW  125.389999  126.559998  124.970001  126.779999   1597300.0
2016-05-03      A   41.320000   41.240002   40.910000   41.490002   1334000.0
2016-05-03    AAL   34.759998   34.580002   33.849998   34.770000  10674200.0
2016-05-03    AAP  155.229996  156.009995  153.910004  156.970001    529400.0
2016-05-03   AAPL   94.199997   95.180000   93.680000   95.739998  56831300.0
2016-05-03   ABBV   60.990002   61.770000   60.720001   62.090000   9316600.0
2016-05-03    ABC   84.930000   85.480003   84.430000   86.070000   1949000.0
2016-05-03    ABT   38.799999   38.549999   38.209999   38.830002  17871200.0
2016-05-03    ACN  113.480003  113.300003  112.250000  113.879997   2031600.0
2016-05-03   ADBE   94.070000   93.660004   93.089996   94.389999   1811400.0
2016-05-03    ADI   56.330002   56.230000   56.080002   56.720001   1646600.0
2016-05-03    ADM   39.950001   39.099998   39.029999   40.650002   5116900.0
2016-05-03    ADP   89.190002   88.809998   87.849998   89.489998   3248000.0
2016-05-03    ADS  201.809998  201.100006  200.419998  202.300003    783900.0
2016-05-03   ADSK   60.869999   60.340000   59.700001   61.200001   1802400.0
2016-05-03    AEE   48.189999   48.549999   48.189999   48.750000   1589800.0
2016-05-03    AEP   64.320000   64.500000   64.070000   64.699997   4461300.0
2016-05-03    AES   11.200000   11.130000   10.950000   11.240000   4572100.0
2016-05-03    AET  113.459999  114.070000  113.300003  114.930000   1777600.0
2016-05-03    AFL   68.769997   68.970001   68.260002   69.040001   2845600.0
2016-05-03    AGN  217.589996  214.820007  214.000000  217.710007   3593300.0
2016-05-03    AIG   55.060001   55.939999   54.959999   56.060001  11985000.0
2016-05-03    AIZ   85.639999   86.230003   85.379997   86.589996    723500.0
2016-05-03    AJG   46.470001   46.389999   46.119999   46.709999   1030600.0
2016-05-03   AKAM   50.820000   49.910000   49.639999   50.939999   1979100.0
2016-05-03    ALB   67.559998   67.330002   66.830002   68.089996    871900.0
2016-05-03    ALK   70.500000   70.410004   69.599998   70.900002   1408800.0
2016-05-03    ALL   64.800003   65.410004   64.669998   65.589996   1861100.0
2016-05-03   ALLE   66.300003   65.690002   65.400002   66.440002    822800.0
...           ...         ...         ...         ...         ...         ...
2016-05-04     VZ   50.480000   50.840000   50.200001   50.990002   9033800.0
2016-05-04    WAT  130.410004  130.729996  129.690002  131.270004    421100.0
2016-05-04    WBA   81.040001   81.489998   80.839996   81.720001   3480700.0
2016-05-04    WDC   39.310001   39.599998   38.419998   39.880001  10122300.0
2016-05-04    WEC   58.919998   60.099998   58.919998   60.509998   2269600.0
2016-05-04    WFC   49.060001   48.939999   48.680000   49.270000  22402500.0
2016-05-04    WFM   28.520000   28.510000   28.180000   28.750000  12498100.0
2016-05-04    WHR  175.440002  175.179993  174.009995  178.059998    960000.0
2016-05-04     WM   59.840000   60.410000   59.439999   60.459999   2219700.0
2016-05-04    WMB   19.110001   19.240000   18.350000   19.430000   9709200.0
2016-05-04    WMT   66.849998   67.190002   66.440002   67.489998   6029500.0
2016-05-04    WRK   39.570000   38.959999   38.340000   39.570000   2309900.0
2016-05-04     WU   19.730000   19.010000   18.860001   19.969999   8927400.0
2016-05-04     WY   31.400000   31.440001   31.309999   31.670000   5208900.0
2016-05-04    WYN   70.430000   69.949997   69.699997   70.940002   1175400.0
2016-05-04   WYNN   92.379997   91.230003   90.120003   93.470001   3308200.0
2016-05-04    XEC  105.930000  106.150002  102.910004  107.010002   1754900.0
2016-05-04    XEL   40.450001   41.009998   40.450001   41.270000   3372100.0
2016-05-04     XL   32.240002   32.400002   32.130001   32.770000   5817100.0
2016-05-04   XLNX   43.340000   42.980000   42.840000   43.709999   3431700.0
2016-05-04    XOM   88.300003   87.940002   87.599998   88.739998  10601100.0
2016-05-04   XRAY   59.660000   59.869999   59.259998   60.029999   1059900.0
2016-05-04    XRX    9.440000    9.450000    9.400000    9.540000   9664000.0
2016-05-04    XYL   41.759998   41.250000   40.950001   41.759998   1424900.0
2016-05-04   YHOO   35.810001   36.000000   35.740002   36.090000   9668700.0
2016-05-04    YUM   56.973401   57.979871   56.937456   58.094896   3604100.0
2016-05-04    ZBH  114.459999  114.690002  113.739998  114.980003   1315400.0
2016-05-04   ZION   26.610001   25.930000   25.549999   26.889999   4993400.0
2016-05-04    ZTS   47.910000   47.049999   46.049999   48.040001   5430400.0
2016-05-04    AIV   41.130001   42.169998   40.540001   42.250000    969400.0

[1000 rows x 6 columns]

- Once you have the dataframe has a datetime index, you can easily plot the time series graph across different columns.
- i.e the closing price of Apple Inc

In [186]:
#%matplotlib inline
#split_adjusted_price[split_adjusted_price['symbol'] == 'AAPL'].close.plot()
#split_adjusted_price.groupby('symbol').get_group('AAPL')
split_adjusted_price.symbol.where #(lambda t:t=='AAPL').dropna()

SyntaxError: invalid syntax (<ipython-input-186-272e1671f6f5>, line 4)

In [ ]:
split_adjusted_price.groupby('symbol').get_group

<p><a name="sol"></a></p>
# Soluitons

**Exercise 1**

In [151]:
NYC=pd.DataFrame([['Bronx',1.39,42],
                ['Manhattan',1.59,23],
                ['Brooklyn',2.47,71],
                ['Staten Island',0.44,59],
                ['Queens',2.23,109]],columns=['boro','pop','area'])

NYC['density']=NYC['pop']/NYC['area']
NYC=NYC.set_index('boro')
NYC

                pop  area   density
boro
Bronx          1.39    42  0.033095
Manhattan      1.59    23  0.069130
Brooklyn       2.47    71  0.034789
Staten Island  0.44    59  0.007458
Queens         2.23   109  0.020459

**Exercise 3**

In [152]:
NYC3=pd.concat([NYC, new_features], axis = 1)
NYC3

                pop  area   density     geography       high_point inception
Bronx          1.39    42  0.033095   on mainland      Chapel Farm      1898
Brooklyn       2.47    71  0.034789     on island      Battle Hill      1634
Manhattan      1.59    23  0.069130  is an island     Bennett Park      1624
Queens         2.23   109  0.020459     on island  North Glen Oaks      1683
Staten Island  0.44    59  0.007458  is an island        Todt Hill      1683

**Exercise 4**

In [153]:
NYC4=pd.merge(NYC3.reset_index(),Elevations,left_on='high_point',right_on='location').set_index('index')
NYC4.columns=NYC4.columns.str.replace('elevation','peak_elevation')
NYC4=NYC4.sort_values('peak_elevation',ascending=False)

**Exercise 5**

In [154]:
Employee=Employee.replace('?',np.nan)
Employee
np.sum(Employee.isnull(), axis=1)
np.sum(Employee.isnull(), axis=0)
Employee.loc[Employee.isnull().any(axis=1),:]
Employee.loc[:,Employee.isnull().any(axis=0) ]

  Department Education  Year
0         IT  Bachelor   1.0
1         IT    Master   2.0
2         HR    Master   2.0
3         HR  Bachelor   2.0
4      Trade       PHD   3.0
5        NaN       PHD   5.0
6      Trade    Master   NaN
7         HR    Master   8.0
8         IT       NaN   9.0

**Exercise 6**

In [155]:
Country.groupby('coastal').agg({'life expectancy':['min','max']})
Country.groupby(['continent','coastal']).agg({'deathrate':['count','mean']})
Country['density']=Country['population']/Country['area']
Country['dense']=Country['density']>Country['density'].mean()
def diff_(x):
    return max(x)-min(x)
Country.groupby('dense').agg({'birthrate':['mean',diff_]})

       birthrate
            mean diff_
dense
False  21.687805  29.6
True   17.488235  35.6